[
    {
        "date": "2025-01-24",
        "time": "15:04",
        "title": "Samsung Galaxy S23 Ultra 5G AI Smartphone (Phantom Black, 12GB, 256GB Storage)",
        "price": "₹71,999",
        "discount": "-52%",
        "sentiment": "Overwhelmingly positive;  praised for camera, performance, and display; some battery concerns.\n",
        "reviews": [
            {
                "date": "14 October 2024",
                "title": "my experience of using the S23 ultra for 1 onth",
                "rating": "5.0 out of 5 stars",
                "text": "I had switched to the S23 Ultra from the iPhone 13. For me, the S23 Ultra is in a different league compared to the iPhone 13. The cameras are so much better and the telephoto lens of the phone also adds an interesting and useful component to the phone. even when gaming, it gives me 120 fps in most of the games. the display is fantastic and even the charging is adequately fast and reliable. (you need to buy the 45w charger separately.) apart from that, the speakers are fantastic and the haptic feedback is great too. The only major downside I found is that it heats a little bit while you play heavy games and the phone charges slowly while being used. overall, if you can get this phone below 85k now, definitely go for it as it almost has no difference compared to the S24 ultra. The battery backup is also great and 1.5 charging cycles lasts me the entire day. (my average SOT is 10-14 hours). The S pen is also quite handy and is useful occasionally. I would say this is the best all-rounder Android phone you can get if you're looking for a phone below the 100k barrier. Also, the phone will get updates till Android 17 so there is no worry of the OS falling back in time and will run you a good 3 years even if you buy the phone now. Remember that the phone is huge and only buy it if you're comfortable with this form factor or this phone may render as useless to you. go for the regular s23 models if you're not a hardcore user but if you have the budget and requiremnts of the features in this phone i would 100% recommend this phone to you."
            },
            {
                "date": "15 January 2025",
                "title": "Awesome Phone",
                "rating": "5.0 out of 5 stars",
                "text": "Samsung Galaxy S23 Ultra: A Powerhouse of Performance\nThe Samsung Galaxy S23 Ultra is a top-tier smartphone that excels in almost every category. Its standout features include:\n* Incredible Camera: The 200MP main sensor captures stunning photos with incredible detail and dynamic range.\n* Powerful Performance: The Snapdragon 8 Gen 2 processor delivers blazing-fast speeds and smooth multitasking.\n* Vibrant Display: The dynamic AMOLED 2X display boasts incredible brightness, sharp visuals, and smooth scrolling.\n* Long-lasting Battery: The large battery provides all-day endurance, even with heavy usage.\nHowever:\n* Expensive: The S23 Ultra comes with a premium price tag.\n* S Pen can be finicky: Some users find the S Pen integration to be less seamless than advertised.\nOverall:\nThe Samsung Galaxy S23 Ultra is an exceptional smartphone for demanding users. If you're looking for the best of the best and are willing to pay the price, it's a fantastic choice.\nDisclaimer: This is a brief overview. For a more in-depth analysis, please refer to full reviews from reputable tech publications.\nI hope this helps!"
            },
            {
                "date": "31 December 2024",
                "title": "Mobile of the year 2023 and 2024",
                "rating": "5.0 out of 5 stars",
                "text": "Awesome phone just loving it though indont use for gaming etc mainy social media and multiple taskings only and camera and all these area its good..initially i was worried when i got to know that there is no app lock but later after getting used to secure folder secured by knox i am happy with it, display is good is sound is also good connecitvity is alao good and works well with samsung eco system\nWhen i purchased there were very few pieces in the market and i i had to sold old phone and get new one so i got one with a bit higher price...buts a value for money.."
            },
            {
                "date": "19 January 2025",
                "title": "Good but battery issue",
                "rating": "4.0 out of 5 stars",
                "text": "Phone look wise amazing\nGreat camera quality both front and rear value for money\nGreat Touch quality and smoothness\nAI feature is functionality fantastic\n\nBut as far as battery life is concerned draining very fast .....needs to charge twice or thrice a day without any heavy usage of phone\n\nApart from this phn is gud so far"
            },
            {
                "date": "13 September 2024",
                "title": "Go for it",
                "rating": "5.0 out of 5 stars",
                "text": "Samsung S23 Ultra Review\n\nS23 Ultra is a true powerhouse and an impressive flagship device. Here’s a breakdown of the key features and performance:\n\nDesign & Build: The design is sleek and premium with a polished metal frame and glass back. It feels solid in hand, though it’s slightly heavier due to its large size. The curved edges and near-bezel-less display give it a modern, elegant look.\n\nDisplay: The 6.8-inch Dynamic AMOLED 2X display is stunning. Colors are vibrant, blacks are deep, and it offers fantastic brightness even in direct sunlight. The 120Hz refresh rate makes scrolling smooth and the overall experience buttery.\n\nPerformance: Powered by the Snapdragon 8 Gen 2 chipset (or Exynos, depending on the region), this phone can handle anything you throw at it. Whether gaming, multitasking, or using heavy apps, the performance remains snappy without any lags.\n\nCamera: The highlight of the S23 Ultra is its camera setup. The 200MP main sensor captures incredible detail, and the photos in good lighting are rich and sharp. Low-light performance is also top-notch. The 10x optical zoom is another standout feature, allowing for clear shots from afar. It’s ideal for photography enthusiasts.\n\nBattery Life: With a 5000mAh battery, the S23 Ultra comfortably lasts a full day on moderate use. Even with heavy use, you can get through the day without needing a recharge. Fast charging and wireless charging are both supported, though it lacks the ultra-fast charging speeds seen in some competitors.\n\nSoftware: Running on Android 13 with Samsung’s One UI, the experience is smooth and highly customizable. Samsung has also committed to providing long-term software updates, which is a big plus for future-proofing the device.\n\nVerdict: The Samsung S23 Ultra is a premium device with a price tag to match, but it justifies the cost with its exceptional display, powerful performance, and top-tier camera capabilities. If you're looking for a flagship Android phone that excels in nearly every aspect, the S23 Ultra is a strong contender.\n\nPros:\n\nStunning AMOLED display\n\nExceptional camera performance\n\nStrong performance for gaming and multitasking\n\nSolid battery life\n\nCons:\n\nQuite bulky and heavy\n\nExpensive"
            }
        ]
    },
    {
        "date": "2025-01-24",
        "time": "15:04",
        "title": "Apple iPhone 15 (256 GB) - Black",
        "price": "₹69,999",
        "discount": "-22%",
        "sentiment": "Overwhelmingly positive; users praise performance, camera, and design, but some cite battery concerns and price.\n",
        "reviews": [
            {
                "date": "6 October 2023",
                "title": "iPhone 15 A solid upgrade and value for money",
                "rating": "5.0 out of 5 stars",
                "text": "Design\nOne of the most noticeable changes to the iPhone 15 is its new design. The phone now has rounded edges, which makes it feel more comfortable in the hand. It also has a new camera bump that is less pronounced than the one on the iPhone 14.\n\nDisplay\nThe iPhone 15 has the same 6.1-inch Super Retina XDR display as the iPhone 14. However, the new display is brighter and has better contrast. It also supports HDR10 and Dolby Vision.\n\nPerformance\nThe iPhone 15 is powered by the new A16 Bionic chip, which is the fastest mobile chip on the market. The A16 Bionic chip is up to 20% faster than the A15 Bionic chip in the iPhone 14.\n\nCamera\nThe iPhone 15 has a new 48-megapixel main camera. The new camera sensor is larger than the one in the iPhone 14, and it has better low-light performance. The iPhone 15 also has a new 12-megapixel ultrawide camera and a new 12-megapixel telephoto camera.\n\nBattery life\nThe iPhone 15 has the same battery life as the iPhone 14. This means that you can expect to get around a day of use on a single charge. Overall The iPhone 15 is a solid upgrade over the iPhone 14.\n\nPros\nNew design with rounded edges\nMore powerful A16 Bionic chip found in 14 pro\nNew 48-megapixel main camera\nBrighter display with upto 2000 nits brightness\nUSB C can be used for anything\nDynamic Island\n\nCons\nNo 120hz display\nNo Macro photography"
            },
            {
                "date": "15 January 2025",
                "title": "Awesome product..value for money.",
                "rating": "5.0 out of 5 stars",
                "text": "Awesome stuff at a very affordable rate. Looks are amazing, functions superlative and feel to hold it is, smooooth...GO for it- product."
            },
            {
                "date": "24 July 2024",
                "title": "Iphone from Apple as usual top in quality and experiance.",
                "rating": "5.0 out of 5 stars",
                "text": "First of it looks very very prime quality and nicely fit in your hands. I am an android user still I don't face issue at the time of operating. In India you have to download required apps from app store free of cost. Apple store not available in India. You can use two sim , one physical micro sim and other esim. Conversion of physical micro sim to esim is very easy and happen in just two hours from your home. But after conversion sms service restricted for 24 hours as per guidelines if TRAI. No issue of connectivity if you have good network strength of your desired operator. Very crispy screen gives no strain on your eyes. Battery life is awesome , 1 one day for heavy user and 2 days for light user. Smooth performance of IOS system, no lags ,no glitches , not a single problem when you get to use. Sound is also very big but very crystal clear. Value is on high side, so though it is very good in all aspects, many people may find it very difficult to purchase ."
            },
            {
                "date": "16 January 2025",
                "title": "Jusstttt awesome 👍🎀..",
                "rating": "4.0 out of 5 stars",
                "text": ""
            },
            {
                "date": "7 October 2023",
                "title": "iPhone XR to iPhone 15",
                "rating": "5.0 out of 5 stars",
                "text": "Just made the transition and here’s my POV on the first ~2 month of use\n\nPros\n- Battery Life is awesome, easily get about a day plus on this, so no Compliants\n- Screen fluidity is smooooooth! Understandable as I’m transitioning into an OLED from LCD in XR. The panel gets a solid peak brightness quotient so happy here\n- Screen brightness is good as compared to XR, 2200 nits, but I hardly go beyond 30% brightness to save some juice. Whilst outside I did crank it up and it’s spotless\n- Dynamic Island is fun, yet to use it to the fullest. Like the way it shows the ETA on delivery and Uber. Simple solution instead of you having to get into the app to check on the ETA\n- Weight, this phone is soo bloody light!! Understandable as XR was a brick, this is soo welcome\n- Camera is awesome, love the 48MP intervention, the portrait mode and cinematic mode does the job for me.\n- The Apple eco system, I enjoy seamless integration of my Watch, Mac, IPad Air and IPhone\n- Apples approach on Security!\n- Transferring data from my XR to 15 using the built in app is flawless\n\nCons\n- The phone was over heating , there is a solution to this from Apple = back up the phone and then erase and reset the phone… including your eSIM settings.. once done set up the phone with the back up….. works like a charm\n- I still believe Apple should have thrown in a charging brick with such purchases\n\nIndustry memes\n- USB C : honestly don’t give a jack for the reviews out there on this. It’s just a mode of charging for me and that’s it. I’m not going to be transferring any data so yea, 2.0 speed yadadada - thank you so much\n- Blue is not blue but white! Think people whining about this should go back to 13/14 or those ludicrous blues in Androids!! These are pestle shades people!!\n- Buying an Apple product to show off!! I mean, you even serious? You buy a product and then comment on why you should not buy one?\n- 60hz refresh rate for a 80k phone : save your jokes people, there are many of us who appreciate quality and security than how the screen refreshes. For non gamers like me, panel that is here is apt. I’ve seen a ton of folks buying 120hz phones and using it only to make calls, watch some videos and for texting\n\nTips of managing battery health\n- Switch off background app refresh for apps you don’t need back ground refresh\n- Avoid wireless charging as this heats your devise up\n- I charge my phone only using a power bank not direct wired or wireless charging\n- Don’t let the battery go below 20%, keep it always between 95% and 20%\n- Switch off location services and allow only certain app that needs your location service\n- Switch on Charging Optimisation under the battery section\n- I don’t use vibrate mode for rings/incoming calls etc\n- My XR after 5 years of use has 86% battery health so I guess I know what I’m recommending above\n\nVendor Experience : Appario Retail Private Limited. 5/5, been a regular customer and they have never disappointed me even once. The purchase experience is breezy and quick, thanks team for the support and look forward to the collaboration in the future.\n\n….. watch out for this space. Will keep updating in case of significant change in experience"
            },
            {
                "date": "11 January 2025",
                "title": "Excellent.",
                "rating": "5.0 out of 5 stars",
                "text": "Fast Charging.It is very smooth.sound is boost.Its perfomance is excellent.its functions are pour."
            },
            {
                "date": "19 January 2025",
                "title": "Great choice",
                "rating": "5.0 out of 5 stars",
                "text": "Excellent phone. Value for money."
            },
            {
                "date": "12 October 2023",
                "title": "It's about the great iPhone 15",
                "rating": "4.0 out of 5 stars",
                "text": "Everyone know about pros , let's only talk about cons\nBattery : worst than I expect . Many says it is iOS 17 behind poor battery life . Hardly 3-4 he if you travelling and your network changes frequently .. worst than my android devices .\nPerformance : no doubt in performance , it's the best in the industry ,\nCamera : undoubtably very good in camera dipartment but I hardly take photos 😁\niOS : verry smooth and many good things are missing . Call recording , call pick up haptic , smart dial and many more little but verry important feature ..\nMany youtuber says there is no such use of dynamic island but listen to me it is verry usefull and looking cool too\nPrice : obviously it's not value for money but it's far better than 13 and 14 launch price which is same . Although this time iPhone 15 far better than 15 pro"
            }
        ]
    },
    {
        "date": "2025-01-24",
        "time": "15:04",
        "title": "Sony Digital Camera ZV-1 Only (Compact, Video Eye AF, Flip Screen, in-Built Microphone, 4K Vlogging Camera for Content Creation) - Black",
        "price": "₹49,990",
        "discount": "-26%",
        "sentiment": "Mostly positive; users praise video quality and autofocus, but criticize battery life and price.\n",
        "reviews": [
            {
                "date": "28 January 2023",
                "title": "Impressive camera for videos and vlogging",
                "rating": "5.0 out of 5 stars",
                "text": "I bought ZV-1 for making videos for my YouTube channel and Instagram. The camera captures good 4K videos and has good stabilization. It also smoothes skin, a kind of beauty mode to make you look good in videos.\n\nThe autofocus is also really good. Features like Product Showcase and Background Defocus also make it better. If you need a compact camera for vlogging, get it. This camera is not good for photos. It also lacks longer zoom range. In case you want a camera that can also capture good photos, avoid it. Consider it as a video camera only."
            },
            {
                "date": "12 August 2022",
                "title": "Excellent travel camera",
                "rating": "4.0 out of 5 stars",
                "text": "Like all modern sony cameras, you gotta know to a certain extent what you're doing to get the most out of the cameras. To be fair, this applies to all cameras including smartphone cameras, but that's beside the point.\nAnyway, this camera was released about 2 years ago at the time of me writing this. I bought it for someone else, as it fit the budget and it has all the features that they'll need. I did have a day to test it out and the TLDR is that it's a very easy recommendation for anyone who wants a compact camera that can take excellent stills and videos but doesn't need a huge zoom range.\n\nMy primary digital camera is a sony a6600, and the zv-1 has a very similar image quality to that. Both in video and photo modes. The a6600 of course has more dynamic range and better low light but that camera also costs a little over twice as much as this one and both serve different demographics.\n\nThe zv-1 has an adequately fast (i.e. wide aperture) lens with equivalent focal length of 24-70mm, which is a solid range for most things. The lens is sharp throughout the zoom range and has very little defects (defects as in chromatic aberration, distortion, vignette etc.).\n\nThe video quality is excellent. If you know your way around any NLE, I'd recommend shooting in 4k @100mbps always and with a custom picture profile with gamma set to s-log2 and gamut set to itu709. Set detail to the lowest possible value (-7). That, i find, to be the optimal setting for the low bitrate 8bit footage. If you don't want to do post processing, perhaps I'd suggest using no picture profile but turning up DRO to max.\n\nThe cons would include a very short battery life. However, the camera can be powered indefinitely with a power bank. I reckon it's an acceptable tradeoff for the tiny footprint of the camera. Speaking of which, you might also wanna get a strap for it as it doesn't come with one and if you have bigger hands like i do, there's definitely a risk of it falling.\n\nI didn't have time to do super thorough tests, but from what I've seen, I think I can easily recommend this camera to anyone who wouldn't mind the limitations of it. The primary limitations being a smaller sensor size, fixed lens and a small battery.\n\nOh, and it doesn't have a flash built in but I kinda prefer not having a built in flash because i never use it and it's just one more thing waiting to break."
            },
            {
                "date": "25 October 2020",
                "title": "Beginner friendly ZV1",
                "rating": "5.0 out of 5 stars",
                "text": "Best camera you can buy as a content creator!\n\nI always confused between Canon m50 or Sony ZV1. Atleast choose the ZV1. Because of these resons,\n1. Great Autofocus ( Very very useful. Sony cameras are very reliable)\n\n2. Quality (Sony smashed Canon)\n\n3. Less croped, usable 4k recording ( As compared to m50)\n\n4. Low light capability (Much much better than m50)\n\n5. Value for money ( I calculted overall cost to get the same things from M50, and it cost more than ZV1)\n\nBut, yes there have two major drawbacks,\n1. Battery (Yes you'll get more battery life in m50 compared to ZV1)\n\n2. 24mm lens ( I think 16mm is the best lens for vlogging and you can buy one for M50. For ZV1, yes it's 24mm is wide but not as much as you need for vlogging.)\n\nConclusion - If you need Quality, reliability and compactability just like me, this is the camera you need.\n\nNo other camera on the market can beat it in this price point."
            },
            {
                "date": "22 October 2020",
                "title": "Just the Camera a new Youtuber needed... Blindly u can go for this Camera",
                "rating": "5.0 out of 5 stars",
                "text": "Award winning Autofocus Sony lens alongwith rotating screen with Background Defocus what can u expect more on a camera for Vlogging.\n\nPros :-\nCompact\nEase to operate\nBackground defocus\nflip screen\nmicrophone jack and clamp\n4K and slow motion recording\nPAL & NTSC mode\nSexy slim look\nEye tracking autofocus\nProduct Showcase mode\n\nCons:-\nNo touch screen\nBattery is less\nBeauty mode\nND Filter\nGood Stabilization feature (Standard & Active)\nno fast charging\n\nBest for new YT creator with budget and also for Pro YT for review videos.\nI am happy with the investment... Must have for videos and photos...\nNo phone can match this camera clarity"
            },
            {
                "date": "9 October 2024",
                "title": "Worst camera.",
                "rating": "1.0 out of 5 stars",
                "text": "Its quality is consistently worse than my iPhone 14. It even gets froze sometime."
            },
            {
                "date": "11 January 2021",
                "title": "Tiny power house, good for travel and exciting travel photography",
                "rating": "5.0 out of 5 stars",
                "text": "Ordered cam at the earliest. Tested its functionality, operating excellent. Pleased with the size and power packed in it. Only downside is \"had the lens covered wider\"! Can manage with Ulanzi extended mt 08 tripod stick. Hope to enjoy vlog and travel."
            },
            {
                "date": "26 October 2022",
                "title": "Overall a good camera👍 But...👇",
                "rating": "4.0 out of 5 stars",
                "text": "Q. Is it worth 54k?\nNo, should have been around 40k given that it's from \"2020\" & 2023 is almost here.\n\nQ. Is it easy to use?\nYes, if you're a little experienced & No, if you're a first timer, so make sure you watch those tutorials first.\n\nQ. Is it good for social media & especially YT?\nYes! A 100%.\nUPDATE: The camera is out of the box updated to the latest firmware, so you don't need to update it... Seems a little suspicious.\n\nI liked the camera! Not the price tho!\n🙂👍"
            },
            {
                "date": "2 September 2022",
                "title": "Better only for close up shoots",
                "rating": "5.0 out of 5 stars",
                "text": "No doubt this camera is amazing but it is only for front facing vlogging purpose only. You need to keep your face close to the camera for focus or else it records normal footage. Battery drains within 30 minutes. So I bought two extra batteries for it. As per the price, it's not worth. Someone should go with Sony zv e10 instead."
            }
        ]
    },
    {
        "date": "2025-01-24",
        "time": "15:04",
        "title": "Lenovo ThinkPad E14 Intel Core i3 13th Gen 14\" WUXGA IPS 300 Nits Thin and Light Laptop (8GB RAM/512GB SSD/Windows 11 Home/FPR/Black/1Y Onsite/1.41 kg), 21JKS13L00",
        "price": "₹48,590",
        "discount": "-45%",
        "sentiment": "Mixed sentiment; mostly positive with some significant negative experiences regarding product defects and customer service.\n",
        "reviews": [
            {
                "date": "7 November 2024",
                "title": "value for money",
                "rating": "5.0 out of 5 stars",
                "text": "value for money"
            },
            {
                "date": "27 July 2024",
                "title": "Good",
                "rating": "3.0 out of 5 stars",
                "text": "Bit confusing discription for those who uses broad screen like 15 inch width, the actual screen size of this laptop is 16 inch diagonal and 14 inch width. Overall it is working good and fast."
            },
            {
                "date": "21 November 2024",
                "title": "USB and HDMI Port Issue",
                "rating": "1.0 out of 5 stars",
                "text": "HDMI Port Not working after 15 Days. Service center re directing to local service station telling Motherboard need to be replaced, without checking Laptop !"
            },
            {
                "date": "30 January 2023",
                "title": "It's very good Laptop... I am very satisfied in this Device",
                "rating": "5.0 out of 5 stars",
                "text": "I liked the anti glare screen quality of the laptop. Lenovo has a very good laptop 💻👍"
            },
            {
                "date": "6 October 2022",
                "title": "Owesome",
                "rating": "5.0 out of 5 stars",
                "text": "Very good product if it's fits in your budget must go for it"
            },
            {
                "date": "23 October 2024",
                "title": "Great Laptop",
                "rating": "5.0 out of 5 stars",
                "text": "Super laptop, now i understand what the hype around ThinkPad really is.\n\nIt is worth the premium price!!\n\n10/10 recommend"
            },
            {
                "date": "1 January 2023",
                "title": "Performer laptop, value for money",
                "rating": "3.0 out of 5 stars",
                "text": "I am happy with the laptop, since you get what you paid for.\nExpect these in this laptop:\n1. No Kayboard light\n2. Though it says that the display is HD, but the display is not upto the mark. Colour looks different when you change the viewing angle.\n3. Sound quality is quite good\n4. Battery life is moderate. My other i5 thinkpad lasts longer with similar usage. Charges pretty fast with its 65watt charger\n5. It is slightly heavy due to it's metal body"
            },
            {
                "date": "18 October 2024",
                "title": "Amazon se khari nahi kare fraud karta hai sawdhan ho jaye Amazon se",
                "rating": "1.0 out of 5 stars",
                "text": " "
            }
        ]
    },
    {
        "date": "2025-01-24",
        "time": "15:04",
        "title": "Sony PlayStation®5 Console (slim)",
        "price": "₹54,990",
        "discount": "None",
        "sentiment": "Overwhelmingly positive;  minor concerns about seller responsiveness and product age in a few reviews.\n",
        "reviews": [
            {
                "date": "29 June 2024",
                "title": "Impressive Upgrade to the Gaming Experience 😍😍😍😍",
                "rating": "5.0 out of 5 stars",
                "text": "As an avid gamer, I recently upgraded to the PS5 Slim, and I must say, it has completely transformed my gaming experience. Here’s why I think the PS5 Slim is a fantastic choice:\n\n**Performance:** The PS5 Slim delivers breathtaking performance with its lightning-fast load times and seamless gameplay. Whether I'm exploring vast open worlds or engaging in intense multiplayer battles, the console handles everything effortlessly.\n\n**Graphics:** The visuals are simply stunning. The 4K resolution and HDR capabilities bring games to life with vibrant colors and incredible detail. Every frame feels like a work of art, enhancing immersion and making every gaming session unforgettable.\n\n**Controller:** The DualSense controller is a game-changer. The adaptive triggers and haptic feedback add a new layer of realism to games, allowing me to feel every action and movement in a way that was never possible before. It truly enhances the gameplay experience.\n\n**Design:** The PS5 Slim’s sleek and compact design fits perfectly into my gaming setup. It’s not only aesthetically pleasing but also practical, with improved cooling systems that ensure the console stays quiet and cool even during extended gaming sessions.\n\n**Game Library:** With a vast library of exclusive titles and backward compatibility with PS4 games, there's no shortage of games to play on the PS5 Slim. From blockbuster AAA titles to indie gems, there’s something for every type of gamer.\n\n**User Interface:** Navigating the user interface is smooth and intuitive, allowing me to switch between games, apps, and media seamlessly. The interface is designed to prioritize the gaming experience, making it easy to find what I want quickly.\n\n**Overall Experience:** In conclusion, the PS5 Slim has exceeded my expectations in every way. It’s not just a gaming console; it’s a gateway to new adventures and unforgettable experiences. Whether you’re a casual gamer or a hardcore enthusiast, the PS5 Slim is definitely worth every penny. Highly recommended!"
            },
            {
                "date": "5 December 2024",
                "title": "100% Original Product!",
                "rating": "5.0 out of 5 stars",
                "text": "It's a genuine Sony product of Indian variety. The seller is reliable in the sense that I have recieved a genuine Sony PS5 Slim console (disc edition) in perfect condition that opens up new vistas in the world of gaming. This console is a must-have asset for pro and normal gamers. But, one thing to note, please don't expect any after-sales-support from the seller, as I have experienced in my case, when I observed that the yellow warranty card, meant for India, was missing in the console's package, and contacted the seller for support, and unfortunately received no response! Then, I contacted Sony India customer care both over the phone and email, sent the copy of the invoice as generated by the seller, a snapshot of the serial number on the bottom side of the company box, as well as the serial number on the bottom side of the console itself. Next, within a few days, the warranty card was sent by Sony through courier to my residence. Kudos for Sony for this wonderful service! Wish the seller had been equally responsible and prompt in handling customers' issues. However, at the end I hope everything will go well and extend my heartfelt thanks to the seller and Sony for their respective services."
            },
            {
                "date": "29 December 2024",
                "title": "Delivery on-time",
                "rating": "5.0 out of 5 stars",
                "text": "It was delivered on-time. Product is new and in good quality. Seller:e2zStore."
            },
            {
                "date": "28 November 2024",
                "title": "The manufacturing date is 1 year old. I.e Nov’24",
                "rating": "1.0 out of 5 stars",
                "text": "I ordered the slim version on 24th Nov’24 and got delivery on 26th. If the slim version is launched in India in Apr’24, how come I got a slim version manufactured in Nov’23? One year old product.\nCan anyone help? Should I return the product\nPlz"
            },
            {
                "date": "2 January 2025",
                "title": "Best console ever . Worth the Money",
                "rating": "5.0 out of 5 stars",
                "text": "The packaging was perfectly intact. The ps5’s box was shipped in a very spacious cardboard box.Unboxing was very satisfying.Functionalities:\n1 Very powerful. It can handle NFS Unbound smoothly at 4K 60fps with HDR\n2 The dual sense controller can also be used as a normal controller for any BT compatible device\n3 even though it does not have a Bluetooth module, an external adapter can be used to connect BT devices with the BT option in settings\nWould recommend buying"
            },
            {
                "date": "21 November 2024",
                "title": "PS5 slim is lit",
                "rating": "5.0 out of 5 stars",
                "text": "Best gaming console"
            },
            {
                "date": "20 January 2025",
                "title": "Seal was not broken. Little bit damaged",
                "rating": "4.0 out of 5 stars",
                "text": "Console is brand new. Was just afraid to order since it had bad reviews. But at 45.25k it is a steal deal. Fortunately i got a good piece too"
            },
            {
                "date": "15 December 2024",
                "title": "Good product Considering ps4 console is still expensive!",
                "rating": "5.0 out of 5 stars",
                "text": "Steal deal Considering that ps4 console is just a few thousand rupees cheaper.\nGames are expensive but that's ok.\nHeat is managed well."
            }
        ]
    },
    {
        "date": "2025-01-24",
        "time": "15:04",
        "title": "Whirlpool 7 Kg 5 Star Royal Fully-Automatic Top Loading Washing Machine (WHITEMAGIC ROYAL 7.0 GENX, Grey, Hard Water Wash, ZPF Technology)",
        "price": "₹15,000",
        "discount": "-21%",
        "sentiment": "Mostly positive, with some negative experiences due to delivery issues, hard water concerns, and additional accessory costs.\n",
        "reviews": [
            {
                "date": "11 January 2025",
                "title": "Nice product",
                "rating": "5.0 out of 5 stars",
                "text": "Good Product worth money and nice service / installation."
            },
            {
                "date": "18 December 2024",
                "title": "Good But without accessories",
                "rating": "4.0 out of 5 stars",
                "text": "Hi All,\n\nIf you are going to use hard water dont buy this. because it is having hard water wash not water smoothing technology.\nInstallation person will suggest one softner worth 2000 from whrilpool.\nagain they will explain all the accessories in such a way that you will be forced to bye everything like I did. Because no body wantes there product to last less.\nso apart from 15k I spent 5k more for accessories.\n\nstand - they recommend 4 wheel lock iron stand otherwise your drum will vibrate more and may damage soon. = 1525/-\n\nwater softner for better wash and protecting the machine and save you from hard water damages = 2000/-\n\nTheir own Drum cleaner for 9 months and you have to clean once in 45 days = 1400\n\nDetergent which can do the work of vanish, comfort and washing : 350 for 1 ltr (I have taken this just try how it is working)\n\nTotal around 5 k extra.\n\nalthough the machine is good and looks like feature loaded but not recommended to use in Hard water areas like metro cities and all."
            },
            {
                "date": "16 January 2025",
                "title": "Very good products",
                "rating": "5.0 out of 5 stars",
                "text": "Performance very nice...value for money 👌👌👌👌"
            },
            {
                "date": "11 January 2025",
                "title": "Pathetic machine , disgusting product",
                "rating": "1.0 out of 5 stars",
                "text": "I have buyer this product on 22 dec which was delivered to me broken , Amazon’s delivery staff is hurry to get that delivered & leave without completely opened , I call to customer service they suggest me to put this on replacement , which is taken all 19 day to get my replacement machine back , which was delivered 11 jan it was delivered again , now the internal machine system is not working , now Amazon’s team is not provide any solution & asking to return the product again , once again it will take 2 week to get my refund back , wasted of trust , time & money , no solution provided except return"
            },
            {
                "date": "14 January 2025",
                "title": "Value for money product",
                "rating": "5.0 out of 5 stars",
                "text": "Ergonomic design. Good product\n."
            },
            {
                "date": "13 January 2025",
                "title": "Good very much, thank you for",
                "rating": "5.0 out of 5 stars",
                "text": "Hi sir washing machine very good will help you using thank you all"
            },
            {
                "date": "18 January 2025",
                "title": "Good product",
                "rating": "4.0 out of 5 stars",
                "text": "Couldn't download invoice, please address the issue"
            },
            {
                "date": "28 June 2024",
                "title": "Good for the price",
                "rating": "3.0 out of 5 stars",
                "text": "Good things are mention in the product description am listing only Cons compared to samsung 7kg top load bubble wash as I am also using Samsung for 1.5 years\n\nMetal body can catchup corrosion or paint loss over the time and even the small collision creates a dent on the metal body so fiber body would be better option\n\nNo DD (direct drive system) in the Q&A Page it is mentioned that it is direct drive but I got to know that it is not fully direct drive main drive is direct and drum drive is belt so it makes more noise and vibration compared to samsung\n\n5% more vibration and 10% more noise than samsung, anything you do but don't keep the machine on any type of stand or base support stand it will vibrate even more plat surface is better option\n\nHard water wash requires magnetic filter which costs 2000rs extra otherwise hard water wash does not function but in samsung they have built in magnetic filter no need to worry about magnetic filter in samsung\n\nIn any wash mode you select this machine requires more time than samsung\n\nIf you are looking for this product with magnetic filter 2k extra then it is good to go for samsung in the same price range.\n\nDelivery was bit complicated Delivery guy was bit worried to deliver to 1st Floor as my address did not mention the floor number so I had to tip him which is my decision\n\nInstallation experience was wonderful for duct came with no damage and all the functions were working as it should be."
            }
        ]
    },
    {
        "date": "2025-01-24",
        "time": "09:40",
        "title": "Samsung Galaxy S23 Ultra 5G AI Smartphone (Phantom Black, 12GB, 256GB Storage)",
        "price": "₹71,999",
        "discount": "-52%",
        "sentiment": "Overwhelmingly positive;  praised for camera, performance, and display; some battery concerns.\n",
        "reviews": [
            {
                "date": "14 October 2024",
                "title": "my experience of using the S23 ultra for 1 onth",
                "rating": "5.0 out of 5 stars",
                "text": "I had switched to the S23 Ultra from the iPhone 13. For me, the S23 Ultra is in a different league compared to the iPhone 13. The cameras are so much better and the telephoto lens of the phone also adds an interesting and useful component to the phone. even when gaming, it gives me 120 fps in most of the games. the display is fantastic and even the charging is adequately fast and reliable. (you need to buy the 45w charger separately.) apart from that, the speakers are fantastic and the haptic feedback is great too. The only major downside I found is that it heats a little bit while you play heavy games and the phone charges slowly while being used. overall, if you can get this phone below 85k now, definitely go for it as it almost has no difference compared to the S24 ultra. The battery backup is also great and 1.5 charging cycles lasts me the entire day. (my average SOT is 10-14 hours). The S pen is also quite handy and is useful occasionally. I would say this is the best all-rounder Android phone you can get if you're looking for a phone below the 100k barrier. Also, the phone will get updates till Android 17 so there is no worry of the OS falling back in time and will run you a good 3 years even if you buy the phone now. Remember that the phone is huge and only buy it if you're comfortable with this form factor or this phone may render as useless to you. go for the regular s23 models if you're not a hardcore user but if you have the budget and requiremnts of the features in this phone i would 100% recommend this phone to you."
            },
            {
                "date": "15 January 2025",
                "title": "Awesome Phone",
                "rating": "5.0 out of 5 stars",
                "text": "Samsung Galaxy S23 Ultra: A Powerhouse of Performance\nThe Samsung Galaxy S23 Ultra is a top-tier smartphone that excels in almost every category. Its standout features include:\n* Incredible Camera: The 200MP main sensor captures stunning photos with incredible detail and dynamic range.\n* Powerful Performance: The Snapdragon 8 Gen 2 processor delivers blazing-fast speeds and smooth multitasking.\n* Vibrant Display: The dynamic AMOLED 2X display boasts incredible brightness, sharp visuals, and smooth scrolling.\n* Long-lasting Battery: The large battery provides all-day endurance, even with heavy usage.\nHowever:\n* Expensive: The S23 Ultra comes with a premium price tag.\n* S Pen can be finicky: Some users find the S Pen integration to be less seamless than advertised.\nOverall:\nThe Samsung Galaxy S23 Ultra is an exceptional smartphone for demanding users. If you're looking for the best of the best and are willing to pay the price, it's a fantastic choice.\nDisclaimer: This is a brief overview. For a more in-depth analysis, please refer to full reviews from reputable tech publications.\nI hope this helps!"
            },
            {
                "date": "31 December 2024",
                "title": "Mobile of the year 2023 and 2024",
                "rating": "5.0 out of 5 stars",
                "text": "Awesome phone just loving it though indont use for gaming etc mainy social media and multiple taskings only and camera and all these area its good..initially i was worried when i got to know that there is no app lock but later after getting used to secure folder secured by knox i am happy with it, display is good is sound is also good connecitvity is alao good and works well with samsung eco system\nWhen i purchased there were very few pieces in the market and i i had to sold old phone and get new one so i got one with a bit higher price...buts a value for money.."
            },
            {
                "date": "19 January 2025",
                "title": "Good but battery issue",
                "rating": "4.0 out of 5 stars",
                "text": "Phone look wise amazing\nGreat camera quality both front and rear value for money\nGreat Touch quality and smoothness\nAI feature is functionality fantastic\n\nBut as far as battery life is concerned draining very fast .....needs to charge twice or thrice a day without any heavy usage of phone\n\nApart from this phn is gud so far"
            },
            {
                "date": "13 September 2024",
                "title": "Go for it",
                "rating": "5.0 out of 5 stars",
                "text": "Samsung S23 Ultra Review\n\nS23 Ultra is a true powerhouse and an impressive flagship device. Here’s a breakdown of the key features and performance:\n\nDesign & Build: The design is sleek and premium with a polished metal frame and glass back. It feels solid in hand, though it’s slightly heavier due to its large size. The curved edges and near-bezel-less display give it a modern, elegant look.\n\nDisplay: The 6.8-inch Dynamic AMOLED 2X display is stunning. Colors are vibrant, blacks are deep, and it offers fantastic brightness even in direct sunlight. The 120Hz refresh rate makes scrolling smooth and the overall experience buttery.\n\nPerformance: Powered by the Snapdragon 8 Gen 2 chipset (or Exynos, depending on the region), this phone can handle anything you throw at it. Whether gaming, multitasking, or using heavy apps, the performance remains snappy without any lags.\n\nCamera: The highlight of the S23 Ultra is its camera setup. The 200MP main sensor captures incredible detail, and the photos in good lighting are rich and sharp. Low-light performance is also top-notch. The 10x optical zoom is another standout feature, allowing for clear shots from afar. It’s ideal for photography enthusiasts.\n\nBattery Life: With a 5000mAh battery, the S23 Ultra comfortably lasts a full day on moderate use. Even with heavy use, you can get through the day without needing a recharge. Fast charging and wireless charging are both supported, though it lacks the ultra-fast charging speeds seen in some competitors.\n\nSoftware: Running on Android 13 with Samsung’s One UI, the experience is smooth and highly customizable. Samsung has also committed to providing long-term software updates, which is a big plus for future-proofing the device.\n\nVerdict: The Samsung S23 Ultra is a premium device with a price tag to match, but it justifies the cost with its exceptional display, powerful performance, and top-tier camera capabilities. If you're looking for a flagship Android phone that excels in nearly every aspect, the S23 Ultra is a strong contender.\n\nPros:\n\nStunning AMOLED display\n\nExceptional camera performance\n\nStrong performance for gaming and multitasking\n\nSolid battery life\n\nCons:\n\nQuite bulky and heavy\n\nExpensive"
            }
        ]
    },
    {
        "date": "2025-01-24",
        "time": "09:40",
        "title": "Apple iPhone 15 (512 GB) - Black",
        "price": "₹87,999",
        "discount": "-20%",
        "sentiment": "Overwhelmingly positive; users praise design, performance, and camera, though some cite battery concerns and price.\n",
        "reviews": [
            {
                "date": "6 October 2023",
                "title": "iPhone 15 A solid upgrade and value for money",
                "rating": "5.0 out of 5 stars",
                "text": "Design\nOne of the most noticeable changes to the iPhone 15 is its new design. The phone now has rounded edges, which makes it feel more comfortable in the hand. It also has a new camera bump that is less pronounced than the one on the iPhone 14.\n\nDisplay\nThe iPhone 15 has the same 6.1-inch Super Retina XDR display as the iPhone 14. However, the new display is brighter and has better contrast. It also supports HDR10 and Dolby Vision.\n\nPerformance\nThe iPhone 15 is powered by the new A16 Bionic chip, which is the fastest mobile chip on the market. The A16 Bionic chip is up to 20% faster than the A15 Bionic chip in the iPhone 14.\n\nCamera\nThe iPhone 15 has a new 48-megapixel main camera. The new camera sensor is larger than the one in the iPhone 14, and it has better low-light performance. The iPhone 15 also has a new 12-megapixel ultrawide camera and a new 12-megapixel telephoto camera.\n\nBattery life\nThe iPhone 15 has the same battery life as the iPhone 14. This means that you can expect to get around a day of use on a single charge. Overall The iPhone 15 is a solid upgrade over the iPhone 14.\n\nPros\nNew design with rounded edges\nMore powerful A16 Bionic chip found in 14 pro\nNew 48-megapixel main camera\nBrighter display with upto 2000 nits brightness\nUSB C can be used for anything\nDynamic Island\n\nCons\nNo 120hz display\nNo Macro photography"
            },
            {
                "date": "15 January 2025",
                "title": "Awesome product..value for money.",
                "rating": "5.0 out of 5 stars",
                "text": "Awesome stuff at a very affordable rate. Looks are amazing, functions superlative and feel to hold it is, smooooth...GO for it- product."
            },
            {
                "date": "24 July 2024",
                "title": "Iphone from Apple as usual top in quality and experiance.",
                "rating": "5.0 out of 5 stars",
                "text": "First of it looks very very prime quality and nicely fit in your hands. I am an android user still I don't face issue at the time of operating. In India you have to download required apps from app store free of cost. Apple store not available in India. You can use two sim , one physical micro sim and other esim. Conversion of physical micro sim to esim is very easy and happen in just two hours from your home. But after conversion sms service restricted for 24 hours as per guidelines if TRAI. No issue of connectivity if you have good network strength of your desired operator. Very crispy screen gives no strain on your eyes. Battery life is awesome , 1 one day for heavy user and 2 days for light user. Smooth performance of IOS system, no lags ,no glitches , not a single problem when you get to use. Sound is also very big but very crystal clear. Value is on high side, so though it is very good in all aspects, many people may find it very difficult to purchase ."
            },
            {
                "date": "16 January 2025",
                "title": "Jusstttt awesome 👍🎀..",
                "rating": "4.0 out of 5 stars",
                "text": ""
            },
            {
                "date": "7 October 2023",
                "title": "iPhone XR to iPhone 15",
                "rating": "5.0 out of 5 stars",
                "text": "Just made the transition and here’s my POV on the first ~2 month of use\n\nPros\n- Battery Life is awesome, easily get about a day plus on this, so no Compliants\n- Screen fluidity is smooooooth! Understandable as I’m transitioning into an OLED from LCD in XR. The panel gets a solid peak brightness quotient so happy here\n- Screen brightness is good as compared to XR, 2200 nits, but I hardly go beyond 30% brightness to save some juice. Whilst outside I did crank it up and it’s spotless\n- Dynamic Island is fun, yet to use it to the fullest. Like the way it shows the ETA on delivery and Uber. Simple solution instead of you having to get into the app to check on the ETA\n- Weight, this phone is soo bloody light!! Understandable as XR was a brick, this is soo welcome\n- Camera is awesome, love the 48MP intervention, the portrait mode and cinematic mode does the job for me.\n- The Apple eco system, I enjoy seamless integration of my Watch, Mac, IPad Air and IPhone\n- Apples approach on Security!\n- Transferring data from my XR to 15 using the built in app is flawless\n\nCons\n- The phone was over heating , there is a solution to this from Apple = back up the phone and then erase and reset the phone… including your eSIM settings.. once done set up the phone with the back up….. works like a charm\n- I still believe Apple should have thrown in a charging brick with such purchases\n\nIndustry memes\n- USB C : honestly don’t give a jack for the reviews out there on this. It’s just a mode of charging for me and that’s it. I’m not going to be transferring any data so yea, 2.0 speed yadadada - thank you so much\n- Blue is not blue but white! Think people whining about this should go back to 13/14 or those ludicrous blues in Androids!! These are pestle shades people!!\n- Buying an Apple product to show off!! I mean, you even serious? You buy a product and then comment on why you should not buy one?\n- 60hz refresh rate for a 80k phone : save your jokes people, there are many of us who appreciate quality and security than how the screen refreshes. For non gamers like me, panel that is here is apt. I’ve seen a ton of folks buying 120hz phones and using it only to make calls, watch some videos and for texting\n\nTips of managing battery health\n- Switch off background app refresh for apps you don’t need back ground refresh\n- Avoid wireless charging as this heats your devise up\n- I charge my phone only using a power bank not direct wired or wireless charging\n- Don’t let the battery go below 20%, keep it always between 95% and 20%\n- Switch off location services and allow only certain app that needs your location service\n- Switch on Charging Optimisation under the battery section\n- I don’t use vibrate mode for rings/incoming calls etc\n- My XR after 5 years of use has 86% battery health so I guess I know what I’m recommending above\n\nVendor Experience : Appario Retail Private Limited. 5/5, been a regular customer and they have never disappointed me even once. The purchase experience is breezy and quick, thanks team for the support and look forward to the collaboration in the future.\n\n….. watch out for this space. Will keep updating in case of significant change in experience"
            },
            {
                "date": "11 January 2025",
                "title": "Excellent.",
                "rating": "5.0 out of 5 stars",
                "text": "Fast Charging.It is very smooth.sound is boost.Its perfomance is excellent.its functions are pour."
            },
            {
                "date": "19 January 2025",
                "title": "Great choice",
                "rating": "5.0 out of 5 stars",
                "text": "Excellent phone. Value for money."
            },
            {
                "date": "12 October 2023",
                "title": "It's about the great iPhone 15",
                "rating": "4.0 out of 5 stars",
                "text": "Everyone know about pros , let's only talk about cons\nBattery : worst than I expect . Many says it is iOS 17 behind poor battery life . Hardly 3-4 he if you travelling and your network changes frequently .. worst than my android devices .\nPerformance : no doubt in performance , it's the best in the industry ,\nCamera : undoubtably very good in camera dipartment but I hardly take photos 😁\niOS : verry smooth and many good things are missing . Call recording , call pick up haptic , smart dial and many more little but verry important feature ..\nMany youtuber says there is no such use of dynamic island but listen to me it is verry usefull and looking cool too\nPrice : obviously it's not value for money but it's far better than 13 and 14 launch price which is same . Although this time iPhone 15 far better than 15 pro"
            }
        ]
    },
    {
        "date": "2025-01-24",
        "time": "09:40",
        "title": "Sony Digital Camera ZV-1 Only (Compact, Video Eye AF, Flip Screen, in-Built Microphone, 4K Vlogging Camera for Content Creation) - Black",
        "price": "₹49,990",
        "discount": "-26%",
        "sentiment": "Mostly positive; praised for video quality and autofocus, but criticized for battery life and price.\n",
        "reviews": [
            {
                "date": "28 January 2023",
                "title": "Impressive camera for videos and vlogging",
                "rating": "5.0 out of 5 stars",
                "text": "I bought ZV-1 for making videos for my YouTube channel and Instagram. The camera captures good 4K videos and has good stabilization. It also smoothes skin, a kind of beauty mode to make you look good in videos.\n\nThe autofocus is also really good. Features like Product Showcase and Background Defocus also make it better. If you need a compact camera for vlogging, get it. This camera is not good for photos. It also lacks longer zoom range. In case you want a camera that can also capture good photos, avoid it. Consider it as a video camera only."
            },
            {
                "date": "12 August 2022",
                "title": "Excellent travel camera",
                "rating": "4.0 out of 5 stars",
                "text": "Like all modern sony cameras, you gotta know to a certain extent what you're doing to get the most out of the cameras. To be fair, this applies to all cameras including smartphone cameras, but that's beside the point.\nAnyway, this camera was released about 2 years ago at the time of me writing this. I bought it for someone else, as it fit the budget and it has all the features that they'll need. I did have a day to test it out and the TLDR is that it's a very easy recommendation for anyone who wants a compact camera that can take excellent stills and videos but doesn't need a huge zoom range.\n\nMy primary digital camera is a sony a6600, and the zv-1 has a very similar image quality to that. Both in video and photo modes. The a6600 of course has more dynamic range and better low light but that camera also costs a little over twice as much as this one and both serve different demographics.\n\nThe zv-1 has an adequately fast (i.e. wide aperture) lens with equivalent focal length of 24-70mm, which is a solid range for most things. The lens is sharp throughout the zoom range and has very little defects (defects as in chromatic aberration, distortion, vignette etc.).\n\nThe video quality is excellent. If you know your way around any NLE, I'd recommend shooting in 4k @100mbps always and with a custom picture profile with gamma set to s-log2 and gamut set to itu709. Set detail to the lowest possible value (-7). That, i find, to be the optimal setting for the low bitrate 8bit footage. If you don't want to do post processing, perhaps I'd suggest using no picture profile but turning up DRO to max.\n\nThe cons would include a very short battery life. However, the camera can be powered indefinitely with a power bank. I reckon it's an acceptable tradeoff for the tiny footprint of the camera. Speaking of which, you might also wanna get a strap for it as it doesn't come with one and if you have bigger hands like i do, there's definitely a risk of it falling.\n\nI didn't have time to do super thorough tests, but from what I've seen, I think I can easily recommend this camera to anyone who wouldn't mind the limitations of it. The primary limitations being a smaller sensor size, fixed lens and a small battery.\n\nOh, and it doesn't have a flash built in but I kinda prefer not having a built in flash because i never use it and it's just one more thing waiting to break."
            },
            {
                "date": "25 October 2020",
                "title": "Beginner friendly ZV1",
                "rating": "5.0 out of 5 stars",
                "text": "Best camera you can buy as a content creator!\n\nI always confused between Canon m50 or Sony ZV1. Atleast choose the ZV1. Because of these resons,\n1. Great Autofocus ( Very very useful. Sony cameras are very reliable)\n\n2. Quality (Sony smashed Canon)\n\n3. Less croped, usable 4k recording ( As compared to m50)\n\n4. Low light capability (Much much better than m50)\n\n5. Value for money ( I calculted overall cost to get the same things from M50, and it cost more than ZV1)\n\nBut, yes there have two major drawbacks,\n1. Battery (Yes you'll get more battery life in m50 compared to ZV1)\n\n2. 24mm lens ( I think 16mm is the best lens for vlogging and you can buy one for M50. For ZV1, yes it's 24mm is wide but not as much as you need for vlogging.)\n\nConclusion - If you need Quality, reliability and compactability just like me, this is the camera you need.\n\nNo other camera on the market can beat it in this price point."
            },
            {
                "date": "22 October 2020",
                "title": "Just the Camera a new Youtuber needed... Blindly u can go for this Camera",
                "rating": "5.0 out of 5 stars",
                "text": "Award winning Autofocus Sony lens alongwith rotating screen with Background Defocus what can u expect more on a camera for Vlogging.\n\nPros :-\nCompact\nEase to operate\nBackground defocus\nflip screen\nmicrophone jack and clamp\n4K and slow motion recording\nPAL & NTSC mode\nSexy slim look\nEye tracking autofocus\nProduct Showcase mode\n\nCons:-\nNo touch screen\nBattery is less\nBeauty mode\nND Filter\nGood Stabilization feature (Standard & Active)\nno fast charging\n\nBest for new YT creator with budget and also for Pro YT for review videos.\nI am happy with the investment... Must have for videos and photos...\nNo phone can match this camera clarity"
            },
            {
                "date": "9 October 2024",
                "title": "Worst camera.",
                "rating": "1.0 out of 5 stars",
                "text": "Its quality is consistently worse than my iPhone 14. It even gets froze sometime."
            },
            {
                "date": "11 January 2021",
                "title": "Tiny power house, good for travel and exciting travel photography",
                "rating": "5.0 out of 5 stars",
                "text": "Ordered cam at the earliest. Tested its functionality, operating excellent. Pleased with the size and power packed in it. Only downside is \"had the lens covered wider\"! Can manage with Ulanzi extended mt 08 tripod stick. Hope to enjoy vlog and travel."
            },
            {
                "date": "26 October 2022",
                "title": "Overall a good camera👍 But...👇",
                "rating": "4.0 out of 5 stars",
                "text": "Q. Is it worth 54k?\nNo, should have been around 40k given that it's from \"2020\" & 2023 is almost here.\n\nQ. Is it easy to use?\nYes, if you're a little experienced & No, if you're a first timer, so make sure you watch those tutorials first.\n\nQ. Is it good for social media & especially YT?\nYes! A 100%.\nUPDATE: The camera is out of the box updated to the latest firmware, so you don't need to update it... Seems a little suspicious.\n\nI liked the camera! Not the price tho!\n🙂👍"
            },
            {
                "date": "2 September 2022",
                "title": "Better only for close up shoots",
                "rating": "5.0 out of 5 stars",
                "text": "No doubt this camera is amazing but it is only for front facing vlogging purpose only. You need to keep your face close to the camera for focus or else it records normal footage. Battery drains within 30 minutes. So I bought two extra batteries for it. As per the price, it's not worth. Someone should go with Sony zv e10 instead."
            }
        ]
    },
    {
        "date": "2025-01-24",
        "time": "09:40",
        "title": "Lenovo ThinkPad E14 Intel Core i3 13th Gen 14\" WUXGA IPS 300 Nits Thin and Light Laptop (8GB RAM/512GB SSD/Windows 11 Home/FPR/Black/1Y Onsite/1.41 kg), 21JKS13L00",
        "price": "₹48,590",
        "discount": "-45%",
        "sentiment": "Mixed sentiment; mostly positive with some significant negative experiences reported concerning product defects and customer service.\n",
        "reviews": [
            {
                "date": "7 November 2024",
                "title": "value for money",
                "rating": "5.0 out of 5 stars",
                "text": "value for money"
            },
            {
                "date": "27 July 2024",
                "title": "Good",
                "rating": "3.0 out of 5 stars",
                "text": "Bit confusing discription for those who uses broad screen like 15 inch width, the actual screen size of this laptop is 16 inch diagonal and 14 inch width. Overall it is working good and fast."
            },
            {
                "date": "21 November 2024",
                "title": "USB and HDMI Port Issue",
                "rating": "1.0 out of 5 stars",
                "text": "HDMI Port Not working after 15 Days. Service center re directing to local service station telling Motherboard need to be replaced, without checking Laptop !"
            },
            {
                "date": "30 January 2023",
                "title": "It's very good Laptop... I am very satisfied in this Device",
                "rating": "5.0 out of 5 stars",
                "text": "I liked the anti glare screen quality of the laptop. Lenovo has a very good laptop 💻👍"
            },
            {
                "date": "6 October 2022",
                "title": "Owesome",
                "rating": "5.0 out of 5 stars",
                "text": "Very good product if it's fits in your budget must go for it"
            },
            {
                "date": "23 October 2024",
                "title": "Great Laptop",
                "rating": "5.0 out of 5 stars",
                "text": "Super laptop, now i understand what the hype around ThinkPad really is.\n\nIt is worth the premium price!!\n\n10/10 recommend"
            },
            {
                "date": "1 January 2023",
                "title": "Performer laptop, value for money",
                "rating": "3.0 out of 5 stars",
                "text": "I am happy with the laptop, since you get what you paid for.\nExpect these in this laptop:\n1. No Kayboard light\n2. Though it says that the display is HD, but the display is not upto the mark. Colour looks different when you change the viewing angle.\n3. Sound quality is quite good\n4. Battery life is moderate. My other i5 thinkpad lasts longer with similar usage. Charges pretty fast with its 65watt charger\n5. It is slightly heavy due to it's metal body"
            },
            {
                "date": "18 October 2024",
                "title": "Amazon se khari nahi kare fraud karta hai sawdhan ho jaye Amazon se",
                "rating": "1.0 out of 5 stars",
                "text": " "
            }
        ]
    },
    {
        "date": "2025-01-24",
        "time": "09:40",
        "title": "Sony PlayStation®5 Console (slim)",
        "price": "₹54,990",
        "discount": "None",
        "sentiment": "Overwhelmingly positive; minor concerns about seller responsiveness and product age in a few reviews.\n",
        "reviews": [
            {
                "date": "29 June 2024",
                "title": "Impressive Upgrade to the Gaming Experience 😍😍😍😍",
                "rating": "5.0 out of 5 stars",
                "text": "As an avid gamer, I recently upgraded to the PS5 Slim, and I must say, it has completely transformed my gaming experience. Here’s why I think the PS5 Slim is a fantastic choice:\n\n**Performance:** The PS5 Slim delivers breathtaking performance with its lightning-fast load times and seamless gameplay. Whether I'm exploring vast open worlds or engaging in intense multiplayer battles, the console handles everything effortlessly.\n\n**Graphics:** The visuals are simply stunning. The 4K resolution and HDR capabilities bring games to life with vibrant colors and incredible detail. Every frame feels like a work of art, enhancing immersion and making every gaming session unforgettable.\n\n**Controller:** The DualSense controller is a game-changer. The adaptive triggers and haptic feedback add a new layer of realism to games, allowing me to feel every action and movement in a way that was never possible before. It truly enhances the gameplay experience.\n\n**Design:** The PS5 Slim’s sleek and compact design fits perfectly into my gaming setup. It’s not only aesthetically pleasing but also practical, with improved cooling systems that ensure the console stays quiet and cool even during extended gaming sessions.\n\n**Game Library:** With a vast library of exclusive titles and backward compatibility with PS4 games, there's no shortage of games to play on the PS5 Slim. From blockbuster AAA titles to indie gems, there’s something for every type of gamer.\n\n**User Interface:** Navigating the user interface is smooth and intuitive, allowing me to switch between games, apps, and media seamlessly. The interface is designed to prioritize the gaming experience, making it easy to find what I want quickly.\n\n**Overall Experience:** In conclusion, the PS5 Slim has exceeded my expectations in every way. It’s not just a gaming console; it’s a gateway to new adventures and unforgettable experiences. Whether you’re a casual gamer or a hardcore enthusiast, the PS5 Slim is definitely worth every penny. Highly recommended!"
            },
            {
                "date": "5 December 2024",
                "title": "100% Original Product!",
                "rating": "5.0 out of 5 stars",
                "text": "It's a genuine Sony product of Indian variety. The seller is reliable in the sense that I have recieved a genuine Sony PS5 Slim console (disc edition) in perfect condition that opens up new vistas in the world of gaming. This console is a must-have asset for pro and normal gamers. But, one thing to note, please don't expect any after-sales-support from the seller, as I have experienced in my case, when I observed that the yellow warranty card, meant for India, was missing in the console's package, and contacted the seller for support, and unfortunately received no response! Then, I contacted Sony India customer care both over the phone and email, sent the copy of the invoice as generated by the seller, a snapshot of the serial number on the bottom side of the company box, as well as the serial number on the bottom side of the console itself. Next, within a few days, the warranty card was sent by Sony through courier to my residence. Kudos for Sony for this wonderful service! Wish the seller had been equally responsible and prompt in handling customers' issues. However, at the end I hope everything will go well and extend my heartfelt thanks to the seller and Sony for their respective services."
            },
            {
                "date": "29 December 2024",
                "title": "Delivery on-time",
                "rating": "5.0 out of 5 stars",
                "text": "It was delivered on-time. Product is new and in good quality. Seller:e2zStore."
            },
            {
                "date": "28 November 2024",
                "title": "The manufacturing date is 1 year old. I.e Nov’24",
                "rating": "1.0 out of 5 stars",
                "text": "I ordered the slim version on 24th Nov’24 and got delivery on 26th. If the slim version is launched in India in Apr’24, how come I got a slim version manufactured in Nov’23? One year old product.\nCan anyone help? Should I return the product\nPlz"
            },
            {
                "date": "2 January 2025",
                "title": "Best console ever . Worth the Money",
                "rating": "5.0 out of 5 stars",
                "text": "The packaging was perfectly intact. The ps5’s box was shipped in a very spacious cardboard box.Unboxing was very satisfying.Functionalities:\n1 Very powerful. It can handle NFS Unbound smoothly at 4K 60fps with HDR\n2 The dual sense controller can also be used as a normal controller for any BT compatible device\n3 even though it does not have a Bluetooth module, an external adapter can be used to connect BT devices with the BT option in settings\nWould recommend buying"
            },
            {
                "date": "21 November 2024",
                "title": "PS5 slim is lit",
                "rating": "5.0 out of 5 stars",
                "text": "Best gaming console"
            },
            {
                "date": "20 January 2025",
                "title": "Seal was not broken. Little bit damaged",
                "rating": "4.0 out of 5 stars",
                "text": "Console is brand new. Was just afraid to order since it had bad reviews. But at 45.25k it is a steal deal. Fortunately i got a good piece too"
            },
            {
                "date": "15 December 2024",
                "title": "Good product Considering ps4 console is still expensive!",
                "rating": "5.0 out of 5 stars",
                "text": "Steal deal Considering that ps4 console is just a few thousand rupees cheaper.\nGames are expensive but that's ok.\nHeat is managed well."
            }
        ]
    },
    {
        "date": "2025-01-24",
        "time": "09:40",
        "title": "Whirlpool 7 Kg 5 Star Royal Fully-Automatic Top Loading Washing Machine (WHITEMAGIC ROYAL 7.0 GENX, Grey, Hard Water Wash, ZPF Technology)",
        "price": "₹14,990",
        "discount": "-6%",
        "sentiment": "Mixed sentiment.  Positive reviews praise performance and value; negative reviews cite defects,  high accessory costs, and poor customer service.\n",
        "reviews": [
            {
                "date": "11 January 2025",
                "title": "Nice product",
                "rating": "5.0 out of 5 stars",
                "text": "Good Product worth money and nice service / installation."
            },
            {
                "date": "18 December 2024",
                "title": "Good But without accessories",
                "rating": "4.0 out of 5 stars",
                "text": "Hi All,\n\nIf you are going to use hard water dont buy this. because it is having hard water wash not water smoothing technology.\nInstallation person will suggest one softner worth 2000 from whrilpool.\nagain they will explain all the accessories in such a way that you will be forced to bye everything like I did. Because no body wantes there product to last less.\nso apart from 15k I spent 5k more for accessories.\n\nstand - they recommend 4 wheel lock iron stand otherwise your drum will vibrate more and may damage soon. = 1525/-\n\nwater softner for better wash and protecting the machine and save you from hard water damages = 2000/-\n\nTheir own Drum cleaner for 9 months and you have to clean once in 45 days = 1400\n\nDetergent which can do the work of vanish, comfort and washing : 350 for 1 ltr (I have taken this just try how it is working)\n\nTotal around 5 k extra.\n\nalthough the machine is good and looks like feature loaded but not recommended to use in Hard water areas like metro cities and all."
            },
            {
                "date": "16 January 2025",
                "title": "Very good products",
                "rating": "5.0 out of 5 stars",
                "text": "Performance very nice...value for money 👌👌👌👌"
            },
            {
                "date": "11 January 2025",
                "title": "Pathetic machine , disgusting product",
                "rating": "1.0 out of 5 stars",
                "text": "I have buyer this product on 22 dec which was delivered to me broken , Amazon’s delivery staff is hurry to get that delivered & leave without completely opened , I call to customer service they suggest me to put this on replacement , which is taken all 19 day to get my replacement machine back , which was delivered 11 jan it was delivered again , now the internal machine system is not working , now Amazon’s team is not provide any solution & asking to return the product again , once again it will take 2 week to get my refund back , wasted of trust , time & money , no solution provided except return"
            },
            {
                "date": "14 January 2025",
                "title": "Value for money product",
                "rating": "5.0 out of 5 stars",
                "text": "Ergonomic design. Good product\n."
            },
            {
                "date": "13 January 2025",
                "title": "Good very much, thank you for",
                "rating": "5.0 out of 5 stars",
                "text": "Hi sir washing machine very good will help you using thank you all"
            },
            {
                "date": "18 January 2025",
                "title": "Good product",
                "rating": "4.0 out of 5 stars",
                "text": "Couldn't download invoice, please address the issue"
            },
            {
                "date": "28 June 2024",
                "title": "Good for the price",
                "rating": "3.0 out of 5 stars",
                "text": "Good things are mention in the product description am listing only Cons compared to samsung 7kg top load bubble wash as I am also using Samsung for 1.5 years\n\nMetal body can catchup corrosion or paint loss over the time and even the small collision creates a dent on the metal body so fiber body would be better option\n\nNo DD (direct drive system) in the Q&A Page it is mentioned that it is direct drive but I got to know that it is not fully direct drive main drive is direct and drum drive is belt so it makes more noise and vibration compared to samsung\n\n5% more vibration and 10% more noise than samsung, anything you do but don't keep the machine on any type of stand or base support stand it will vibrate even more plat surface is better option\n\nHard water wash requires magnetic filter which costs 2000rs extra otherwise hard water wash does not function but in samsung they have built in magnetic filter no need to worry about magnetic filter in samsung\n\nIn any wash mode you select this machine requires more time than samsung\n\nIf you are looking for this product with magnetic filter 2k extra then it is good to go for samsung in the same price range.\n\nDelivery was bit complicated Delivery guy was bit worried to deliver to 1st Floor as my address did not mention the floor number so I had to tip him which is my decision\n\nInstallation experience was wonderful for duct came with no damage and all the functions were working as it should be."
            }
        ]
    },
    {
        "date": "2025-01-24",
        "time": "09:34",
        "title": "Samsung Galaxy S23 Ultra 5G AI Smartphone (Phantom Black, 12GB, 256GB Storage)",
        "price": "₹71,999",
        "discount": "-52%",
        "sentiment": "Overwhelmingly positive;  users praise camera, performance, and display, but some note high price and battery concerns.\n",
        "reviews": [
            {
                "date": "14 October 2024",
                "title": "my experience of using the S23 ultra for 1 onth",
                "rating": "5.0 out of 5 stars",
                "text": "I had switched to the S23 Ultra from the iPhone 13. For me, the S23 Ultra is in a different league compared to the iPhone 13. The cameras are so much better and the telephoto lens of the phone also adds an interesting and useful component to the phone. even when gaming, it gives me 120 fps in most of the games. the display is fantastic and even the charging is adequately fast and reliable. (you need to buy the 45w charger separately.) apart from that, the speakers are fantastic and the haptic feedback is great too. The only major downside I found is that it heats a little bit while you play heavy games and the phone charges slowly while being used. overall, if you can get this phone below 85k now, definitely go for it as it almost has no difference compared to the S24 ultra. The battery backup is also great and 1.5 charging cycles lasts me the entire day. (my average SOT is 10-14 hours). The S pen is also quite handy and is useful occasionally. I would say this is the best all-rounder Android phone you can get if you're looking for a phone below the 100k barrier. Also, the phone will get updates till Android 17 so there is no worry of the OS falling back in time and will run you a good 3 years even if you buy the phone now. Remember that the phone is huge and only buy it if you're comfortable with this form factor or this phone may render as useless to you. go for the regular s23 models if you're not a hardcore user but if you have the budget and requiremnts of the features in this phone i would 100% recommend this phone to you."
            },
            {
                "date": "15 January 2025",
                "title": "Awesome Phone",
                "rating": "5.0 out of 5 stars",
                "text": "Samsung Galaxy S23 Ultra: A Powerhouse of Performance\nThe Samsung Galaxy S23 Ultra is a top-tier smartphone that excels in almost every category. Its standout features include:\n* Incredible Camera: The 200MP main sensor captures stunning photos with incredible detail and dynamic range.\n* Powerful Performance: The Snapdragon 8 Gen 2 processor delivers blazing-fast speeds and smooth multitasking.\n* Vibrant Display: The dynamic AMOLED 2X display boasts incredible brightness, sharp visuals, and smooth scrolling.\n* Long-lasting Battery: The large battery provides all-day endurance, even with heavy usage.\nHowever:\n* Expensive: The S23 Ultra comes with a premium price tag.\n* S Pen can be finicky: Some users find the S Pen integration to be less seamless than advertised.\nOverall:\nThe Samsung Galaxy S23 Ultra is an exceptional smartphone for demanding users. If you're looking for the best of the best and are willing to pay the price, it's a fantastic choice.\nDisclaimer: This is a brief overview. For a more in-depth analysis, please refer to full reviews from reputable tech publications.\nI hope this helps!"
            },
            {
                "date": "31 December 2024",
                "title": "Mobile of the year 2023 and 2024",
                "rating": "5.0 out of 5 stars",
                "text": "Awesome phone just loving it though indont use for gaming etc mainy social media and multiple taskings only and camera and all these area its good..initially i was worried when i got to know that there is no app lock but later after getting used to secure folder secured by knox i am happy with it, display is good is sound is also good connecitvity is alao good and works well with samsung eco system\nWhen i purchased there were very few pieces in the market and i i had to sold old phone and get new one so i got one with a bit higher price...buts a value for money.."
            },
            {
                "date": "19 January 2025",
                "title": "Good but battery issue",
                "rating": "4.0 out of 5 stars",
                "text": "Phone look wise amazing\nGreat camera quality both front and rear value for money\nGreat Touch quality and smoothness\nAI feature is functionality fantastic\n\nBut as far as battery life is concerned draining very fast .....needs to charge twice or thrice a day without any heavy usage of phone\n\nApart from this phn is gud so far"
            },
            {
                "date": "13 September 2024",
                "title": "Go for it",
                "rating": "5.0 out of 5 stars",
                "text": "Samsung S23 Ultra Review\n\nS23 Ultra is a true powerhouse and an impressive flagship device. Here’s a breakdown of the key features and performance:\n\nDesign & Build: The design is sleek and premium with a polished metal frame and glass back. It feels solid in hand, though it’s slightly heavier due to its large size. The curved edges and near-bezel-less display give it a modern, elegant look.\n\nDisplay: The 6.8-inch Dynamic AMOLED 2X display is stunning. Colors are vibrant, blacks are deep, and it offers fantastic brightness even in direct sunlight. The 120Hz refresh rate makes scrolling smooth and the overall experience buttery.\n\nPerformance: Powered by the Snapdragon 8 Gen 2 chipset (or Exynos, depending on the region), this phone can handle anything you throw at it. Whether gaming, multitasking, or using heavy apps, the performance remains snappy without any lags.\n\nCamera: The highlight of the S23 Ultra is its camera setup. The 200MP main sensor captures incredible detail, and the photos in good lighting are rich and sharp. Low-light performance is also top-notch. The 10x optical zoom is another standout feature, allowing for clear shots from afar. It’s ideal for photography enthusiasts.\n\nBattery Life: With a 5000mAh battery, the S23 Ultra comfortably lasts a full day on moderate use. Even with heavy use, you can get through the day without needing a recharge. Fast charging and wireless charging are both supported, though it lacks the ultra-fast charging speeds seen in some competitors.\n\nSoftware: Running on Android 13 with Samsung’s One UI, the experience is smooth and highly customizable. Samsung has also committed to providing long-term software updates, which is a big plus for future-proofing the device.\n\nVerdict: The Samsung S23 Ultra is a premium device with a price tag to match, but it justifies the cost with its exceptional display, powerful performance, and top-tier camera capabilities. If you're looking for a flagship Android phone that excels in nearly every aspect, the S23 Ultra is a strong contender.\n\nPros:\n\nStunning AMOLED display\n\nExceptional camera performance\n\nStrong performance for gaming and multitasking\n\nSolid battery life\n\nCons:\n\nQuite bulky and heavy\n\nExpensive"
            }
        ]
    },
    {
        "date": "2025-01-24",
        "time": "09:34",
        "title": "Apple iPhone 15 (512 GB) - Black",
        "price": "₹87,999",
        "discount": "-20%",
        "sentiment": "Overwhelmingly positive; users praise design, performance, and camera, despite some battery and feature concerns.\n",
        "reviews": [
            {
                "date": "6 October 2023",
                "title": "iPhone 15 A solid upgrade and value for money",
                "rating": "5.0 out of 5 stars",
                "text": "Design\nOne of the most noticeable changes to the iPhone 15 is its new design. The phone now has rounded edges, which makes it feel more comfortable in the hand. It also has a new camera bump that is less pronounced than the one on the iPhone 14.\n\nDisplay\nThe iPhone 15 has the same 6.1-inch Super Retina XDR display as the iPhone 14. However, the new display is brighter and has better contrast. It also supports HDR10 and Dolby Vision.\n\nPerformance\nThe iPhone 15 is powered by the new A16 Bionic chip, which is the fastest mobile chip on the market. The A16 Bionic chip is up to 20% faster than the A15 Bionic chip in the iPhone 14.\n\nCamera\nThe iPhone 15 has a new 48-megapixel main camera. The new camera sensor is larger than the one in the iPhone 14, and it has better low-light performance. The iPhone 15 also has a new 12-megapixel ultrawide camera and a new 12-megapixel telephoto camera.\n\nBattery life\nThe iPhone 15 has the same battery life as the iPhone 14. This means that you can expect to get around a day of use on a single charge. Overall The iPhone 15 is a solid upgrade over the iPhone 14.\n\nPros\nNew design with rounded edges\nMore powerful A16 Bionic chip found in 14 pro\nNew 48-megapixel main camera\nBrighter display with upto 2000 nits brightness\nUSB C can be used for anything\nDynamic Island\n\nCons\nNo 120hz display\nNo Macro photography"
            },
            {
                "date": "15 January 2025",
                "title": "Awesome product..value for money.",
                "rating": "5.0 out of 5 stars",
                "text": "Awesome stuff at a very affordable rate. Looks are amazing, functions superlative and feel to hold it is, smooooth...GO for it- product."
            },
            {
                "date": "24 July 2024",
                "title": "Iphone from Apple as usual top in quality and experiance.",
                "rating": "5.0 out of 5 stars",
                "text": "First of it looks very very prime quality and nicely fit in your hands. I am an android user still I don't face issue at the time of operating. In India you have to download required apps from app store free of cost. Apple store not available in India. You can use two sim , one physical micro sim and other esim. Conversion of physical micro sim to esim is very easy and happen in just two hours from your home. But after conversion sms service restricted for 24 hours as per guidelines if TRAI. No issue of connectivity if you have good network strength of your desired operator. Very crispy screen gives no strain on your eyes. Battery life is awesome , 1 one day for heavy user and 2 days for light user. Smooth performance of IOS system, no lags ,no glitches , not a single problem when you get to use. Sound is also very big but very crystal clear. Value is on high side, so though it is very good in all aspects, many people may find it very difficult to purchase ."
            },
            {
                "date": "16 January 2025",
                "title": "Jusstttt awesome 👍🎀..",
                "rating": "4.0 out of 5 stars",
                "text": ""
            },
            {
                "date": "7 October 2023",
                "title": "iPhone XR to iPhone 15",
                "rating": "5.0 out of 5 stars",
                "text": "Just made the transition and here’s my POV on the first ~2 month of use\n\nPros\n- Battery Life is awesome, easily get about a day plus on this, so no Compliants\n- Screen fluidity is smooooooth! Understandable as I’m transitioning into an OLED from LCD in XR. The panel gets a solid peak brightness quotient so happy here\n- Screen brightness is good as compared to XR, 2200 nits, but I hardly go beyond 30% brightness to save some juice. Whilst outside I did crank it up and it’s spotless\n- Dynamic Island is fun, yet to use it to the fullest. Like the way it shows the ETA on delivery and Uber. Simple solution instead of you having to get into the app to check on the ETA\n- Weight, this phone is soo bloody light!! Understandable as XR was a brick, this is soo welcome\n- Camera is awesome, love the 48MP intervention, the portrait mode and cinematic mode does the job for me.\n- The Apple eco system, I enjoy seamless integration of my Watch, Mac, IPad Air and IPhone\n- Apples approach on Security!\n- Transferring data from my XR to 15 using the built in app is flawless\n\nCons\n- The phone was over heating , there is a solution to this from Apple = back up the phone and then erase and reset the phone… including your eSIM settings.. once done set up the phone with the back up….. works like a charm\n- I still believe Apple should have thrown in a charging brick with such purchases\n\nIndustry memes\n- USB C : honestly don’t give a jack for the reviews out there on this. It’s just a mode of charging for me and that’s it. I’m not going to be transferring any data so yea, 2.0 speed yadadada - thank you so much\n- Blue is not blue but white! Think people whining about this should go back to 13/14 or those ludicrous blues in Androids!! These are pestle shades people!!\n- Buying an Apple product to show off!! I mean, you even serious? You buy a product and then comment on why you should not buy one?\n- 60hz refresh rate for a 80k phone : save your jokes people, there are many of us who appreciate quality and security than how the screen refreshes. For non gamers like me, panel that is here is apt. I’ve seen a ton of folks buying 120hz phones and using it only to make calls, watch some videos and for texting\n\nTips of managing battery health\n- Switch off background app refresh for apps you don’t need back ground refresh\n- Avoid wireless charging as this heats your devise up\n- I charge my phone only using a power bank not direct wired or wireless charging\n- Don’t let the battery go below 20%, keep it always between 95% and 20%\n- Switch off location services and allow only certain app that needs your location service\n- Switch on Charging Optimisation under the battery section\n- I don’t use vibrate mode for rings/incoming calls etc\n- My XR after 5 years of use has 86% battery health so I guess I know what I’m recommending above\n\nVendor Experience : Appario Retail Private Limited. 5/5, been a regular customer and they have never disappointed me even once. The purchase experience is breezy and quick, thanks team for the support and look forward to the collaboration in the future.\n\n….. watch out for this space. Will keep updating in case of significant change in experience"
            },
            {
                "date": "11 January 2025",
                "title": "Excellent.",
                "rating": "5.0 out of 5 stars",
                "text": "Fast Charging.It is very smooth.sound is boost.Its perfomance is excellent.its functions are pour."
            },
            {
                "date": "19 January 2025",
                "title": "Great choice",
                "rating": "5.0 out of 5 stars",
                "text": "Excellent phone. Value for money."
            },
            {
                "date": "12 October 2023",
                "title": "It's about the great iPhone 15",
                "rating": "4.0 out of 5 stars",
                "text": "Everyone know about pros , let's only talk about cons\nBattery : worst than I expect . Many says it is iOS 17 behind poor battery life . Hardly 3-4 he if you travelling and your network changes frequently .. worst than my android devices .\nPerformance : no doubt in performance , it's the best in the industry ,\nCamera : undoubtably very good in camera dipartment but I hardly take photos 😁\niOS : verry smooth and many good things are missing . Call recording , call pick up haptic , smart dial and many more little but verry important feature ..\nMany youtuber says there is no such use of dynamic island but listen to me it is verry usefull and looking cool too\nPrice : obviously it's not value for money but it's far better than 13 and 14 launch price which is same . Although this time iPhone 15 far better than 15 pro"
            }
        ]
    },
    {
        "date": "2025-01-24",
        "time": "09:34",
        "title": "Sony Digital Camera ZV-1 Only (Compact, Video Eye AF, Flip Screen, in-Built Microphone, 4K Vlogging Camera for Content Creation) - Black",
        "price": "₹49,990",
        "discount": "-26%",
        "sentiment": "Mostly positive;  users praise video quality and autofocus but cite battery life and price as drawbacks.\n",
        "reviews": [
            {
                "date": "28 January 2023",
                "title": "Impressive camera for videos and vlogging",
                "rating": "5.0 out of 5 stars",
                "text": "I bought ZV-1 for making videos for my YouTube channel and Instagram. The camera captures good 4K videos and has good stabilization. It also smoothes skin, a kind of beauty mode to make you look good in videos.\n\nThe autofocus is also really good. Features like Product Showcase and Background Defocus also make it better. If you need a compact camera for vlogging, get it. This camera is not good for photos. It also lacks longer zoom range. In case you want a camera that can also capture good photos, avoid it. Consider it as a video camera only."
            },
            {
                "date": "12 August 2022",
                "title": "Excellent travel camera",
                "rating": "4.0 out of 5 stars",
                "text": "Like all modern sony cameras, you gotta know to a certain extent what you're doing to get the most out of the cameras. To be fair, this applies to all cameras including smartphone cameras, but that's beside the point.\nAnyway, this camera was released about 2 years ago at the time of me writing this. I bought it for someone else, as it fit the budget and it has all the features that they'll need. I did have a day to test it out and the TLDR is that it's a very easy recommendation for anyone who wants a compact camera that can take excellent stills and videos but doesn't need a huge zoom range.\n\nMy primary digital camera is a sony a6600, and the zv-1 has a very similar image quality to that. Both in video and photo modes. The a6600 of course has more dynamic range and better low light but that camera also costs a little over twice as much as this one and both serve different demographics.\n\nThe zv-1 has an adequately fast (i.e. wide aperture) lens with equivalent focal length of 24-70mm, which is a solid range for most things. The lens is sharp throughout the zoom range and has very little defects (defects as in chromatic aberration, distortion, vignette etc.).\n\nThe video quality is excellent. If you know your way around any NLE, I'd recommend shooting in 4k @100mbps always and with a custom picture profile with gamma set to s-log2 and gamut set to itu709. Set detail to the lowest possible value (-7). That, i find, to be the optimal setting for the low bitrate 8bit footage. If you don't want to do post processing, perhaps I'd suggest using no picture profile but turning up DRO to max.\n\nThe cons would include a very short battery life. However, the camera can be powered indefinitely with a power bank. I reckon it's an acceptable tradeoff for the tiny footprint of the camera. Speaking of which, you might also wanna get a strap for it as it doesn't come with one and if you have bigger hands like i do, there's definitely a risk of it falling.\n\nI didn't have time to do super thorough tests, but from what I've seen, I think I can easily recommend this camera to anyone who wouldn't mind the limitations of it. The primary limitations being a smaller sensor size, fixed lens and a small battery.\n\nOh, and it doesn't have a flash built in but I kinda prefer not having a built in flash because i never use it and it's just one more thing waiting to break."
            },
            {
                "date": "25 October 2020",
                "title": "Beginner friendly ZV1",
                "rating": "5.0 out of 5 stars",
                "text": "Best camera you can buy as a content creator!\n\nI always confused between Canon m50 or Sony ZV1. Atleast choose the ZV1. Because of these resons,\n1. Great Autofocus ( Very very useful. Sony cameras are very reliable)\n\n2. Quality (Sony smashed Canon)\n\n3. Less croped, usable 4k recording ( As compared to m50)\n\n4. Low light capability (Much much better than m50)\n\n5. Value for money ( I calculted overall cost to get the same things from M50, and it cost more than ZV1)\n\nBut, yes there have two major drawbacks,\n1. Battery (Yes you'll get more battery life in m50 compared to ZV1)\n\n2. 24mm lens ( I think 16mm is the best lens for vlogging and you can buy one for M50. For ZV1, yes it's 24mm is wide but not as much as you need for vlogging.)\n\nConclusion - If you need Quality, reliability and compactability just like me, this is the camera you need.\n\nNo other camera on the market can beat it in this price point."
            },
            {
                "date": "22 October 2020",
                "title": "Just the Camera a new Youtuber needed... Blindly u can go for this Camera",
                "rating": "5.0 out of 5 stars",
                "text": "Award winning Autofocus Sony lens alongwith rotating screen with Background Defocus what can u expect more on a camera for Vlogging.\n\nPros :-\nCompact\nEase to operate\nBackground defocus\nflip screen\nmicrophone jack and clamp\n4K and slow motion recording\nPAL & NTSC mode\nSexy slim look\nEye tracking autofocus\nProduct Showcase mode\n\nCons:-\nNo touch screen\nBattery is less\nBeauty mode\nND Filter\nGood Stabilization feature (Standard & Active)\nno fast charging\n\nBest for new YT creator with budget and also for Pro YT for review videos.\nI am happy with the investment... Must have for videos and photos...\nNo phone can match this camera clarity"
            },
            {
                "date": "9 October 2024",
                "title": "Worst camera.",
                "rating": "1.0 out of 5 stars",
                "text": "Its quality is consistently worse than my iPhone 14. It even gets froze sometime."
            },
            {
                "date": "11 January 2021",
                "title": "Tiny power house, good for travel and exciting travel photography",
                "rating": "5.0 out of 5 stars",
                "text": "Ordered cam at the earliest. Tested its functionality, operating excellent. Pleased with the size and power packed in it. Only downside is \"had the lens covered wider\"! Can manage with Ulanzi extended mt 08 tripod stick. Hope to enjoy vlog and travel."
            },
            {
                "date": "26 October 2022",
                "title": "Overall a good camera👍 But...👇",
                "rating": "4.0 out of 5 stars",
                "text": "Q. Is it worth 54k?\nNo, should have been around 40k given that it's from \"2020\" & 2023 is almost here.\n\nQ. Is it easy to use?\nYes, if you're a little experienced & No, if you're a first timer, so make sure you watch those tutorials first.\n\nQ. Is it good for social media & especially YT?\nYes! A 100%.\nUPDATE: The camera is out of the box updated to the latest firmware, so you don't need to update it... Seems a little suspicious.\n\nI liked the camera! Not the price tho!\n🙂👍"
            },
            {
                "date": "2 September 2022",
                "title": "Better only for close up shoots",
                "rating": "5.0 out of 5 stars",
                "text": "No doubt this camera is amazing but it is only for front facing vlogging purpose only. You need to keep your face close to the camera for focus or else it records normal footage. Battery drains within 30 minutes. So I bought two extra batteries for it. As per the price, it's not worth. Someone should go with Sony zv e10 instead."
            }
        ]
    },
    {
        "date": "2025-01-24",
        "time": "09:34",
        "title": "Lenovo ThinkPad E14 Intel Core i3 13th Gen 14\" WUXGA IPS 300 Nits Thin and Light Laptop (8GB RAM/512GB SSD/Windows 11 Home/FPR/Black/1Y Onsite/1.41 kg), 21JKS13L00",
        "price": "₹48,590",
        "discount": "-45%",
        "sentiment": "Mixed sentiment; mostly positive with some complaints about screen, ports, and Amazon seller.\n",
        "reviews": [
            {
                "date": "7 November 2024",
                "title": "value for money",
                "rating": "5.0 out of 5 stars",
                "text": "value for money"
            },
            {
                "date": "27 July 2024",
                "title": "Good",
                "rating": "3.0 out of 5 stars",
                "text": "Bit confusing discription for those who uses broad screen like 15 inch width, the actual screen size of this laptop is 16 inch diagonal and 14 inch width. Overall it is working good and fast."
            },
            {
                "date": "21 November 2024",
                "title": "USB and HDMI Port Issue",
                "rating": "1.0 out of 5 stars",
                "text": "HDMI Port Not working after 15 Days. Service center re directing to local service station telling Motherboard need to be replaced, without checking Laptop !"
            },
            {
                "date": "30 January 2023",
                "title": "It's very good Laptop... I am very satisfied in this Device",
                "rating": "5.0 out of 5 stars",
                "text": "I liked the anti glare screen quality of the laptop. Lenovo has a very good laptop 💻👍"
            },
            {
                "date": "6 October 2022",
                "title": "Owesome",
                "rating": "5.0 out of 5 stars",
                "text": "Very good product if it's fits in your budget must go for it"
            },
            {
                "date": "23 October 2024",
                "title": "Great Laptop",
                "rating": "5.0 out of 5 stars",
                "text": "Super laptop, now i understand what the hype around ThinkPad really is.\n\nIt is worth the premium price!!\n\n10/10 recommend"
            },
            {
                "date": "1 January 2023",
                "title": "Performer laptop, value for money",
                "rating": "3.0 out of 5 stars",
                "text": "I am happy with the laptop, since you get what you paid for.\nExpect these in this laptop:\n1. No Kayboard light\n2. Though it says that the display is HD, but the display is not upto the mark. Colour looks different when you change the viewing angle.\n3. Sound quality is quite good\n4. Battery life is moderate. My other i5 thinkpad lasts longer with similar usage. Charges pretty fast with its 65watt charger\n5. It is slightly heavy due to it's metal body"
            },
            {
                "date": "18 October 2024",
                "title": "Amazon se khari nahi kare fraud karta hai sawdhan ho jaye Amazon se",
                "rating": "1.0 out of 5 stars",
                "text": " "
            }
        ]
    },
    {
        "date": "2025-01-24",
        "time": "09:34",
        "title": "Sony PlayStation®5 Console (slim)",
        "price": "₹54,990",
        "discount": "None",
        "sentiment": "Overwhelmingly positive;  minor concerns about seller responsiveness and product age in a few reviews.\n",
        "reviews": [
            {
                "date": "29 June 2024",
                "title": "Impressive Upgrade to the Gaming Experience 😍😍😍😍",
                "rating": "5.0 out of 5 stars",
                "text": "As an avid gamer, I recently upgraded to the PS5 Slim, and I must say, it has completely transformed my gaming experience. Here’s why I think the PS5 Slim is a fantastic choice:\n\n**Performance:** The PS5 Slim delivers breathtaking performance with its lightning-fast load times and seamless gameplay. Whether I'm exploring vast open worlds or engaging in intense multiplayer battles, the console handles everything effortlessly.\n\n**Graphics:** The visuals are simply stunning. The 4K resolution and HDR capabilities bring games to life with vibrant colors and incredible detail. Every frame feels like a work of art, enhancing immersion and making every gaming session unforgettable.\n\n**Controller:** The DualSense controller is a game-changer. The adaptive triggers and haptic feedback add a new layer of realism to games, allowing me to feel every action and movement in a way that was never possible before. It truly enhances the gameplay experience.\n\n**Design:** The PS5 Slim’s sleek and compact design fits perfectly into my gaming setup. It’s not only aesthetically pleasing but also practical, with improved cooling systems that ensure the console stays quiet and cool even during extended gaming sessions.\n\n**Game Library:** With a vast library of exclusive titles and backward compatibility with PS4 games, there's no shortage of games to play on the PS5 Slim. From blockbuster AAA titles to indie gems, there’s something for every type of gamer.\n\n**User Interface:** Navigating the user interface is smooth and intuitive, allowing me to switch between games, apps, and media seamlessly. The interface is designed to prioritize the gaming experience, making it easy to find what I want quickly.\n\n**Overall Experience:** In conclusion, the PS5 Slim has exceeded my expectations in every way. It’s not just a gaming console; it’s a gateway to new adventures and unforgettable experiences. Whether you’re a casual gamer or a hardcore enthusiast, the PS5 Slim is definitely worth every penny. Highly recommended!"
            },
            {
                "date": "5 December 2024",
                "title": "100% Original Product!",
                "rating": "5.0 out of 5 stars",
                "text": "It's a genuine Sony product of Indian variety. The seller is reliable in the sense that I have recieved a genuine Sony PS5 Slim console (disc edition) in perfect condition that opens up new vistas in the world of gaming. This console is a must-have asset for pro and normal gamers. But, one thing to note, please don't expect any after-sales-support from the seller, as I have experienced in my case, when I observed that the yellow warranty card, meant for India, was missing in the console's package, and contacted the seller for support, and unfortunately received no response! Then, I contacted Sony India customer care both over the phone and email, sent the copy of the invoice as generated by the seller, a snapshot of the serial number on the bottom side of the company box, as well as the serial number on the bottom side of the console itself. Next, within a few days, the warranty card was sent by Sony through courier to my residence. Kudos for Sony for this wonderful service! Wish the seller had been equally responsible and prompt in handling customers' issues. However, at the end I hope everything will go well and extend my heartfelt thanks to the seller and Sony for their respective services."
            },
            {
                "date": "29 December 2024",
                "title": "Delivery on-time",
                "rating": "5.0 out of 5 stars",
                "text": "It was delivered on-time. Product is new and in good quality. Seller:e2zStore."
            },
            {
                "date": "28 November 2024",
                "title": "The manufacturing date is 1 year old. I.e Nov’24",
                "rating": "1.0 out of 5 stars",
                "text": "I ordered the slim version on 24th Nov’24 and got delivery on 26th. If the slim version is launched in India in Apr’24, how come I got a slim version manufactured in Nov’23? One year old product.\nCan anyone help? Should I return the product\nPlz"
            },
            {
                "date": "2 January 2025",
                "title": "Best console ever . Worth the Money",
                "rating": "5.0 out of 5 stars",
                "text": "The packaging was perfectly intact. The ps5’s box was shipped in a very spacious cardboard box.Unboxing was very satisfying.Functionalities:\n1 Very powerful. It can handle NFS Unbound smoothly at 4K 60fps with HDR\n2 The dual sense controller can also be used as a normal controller for any BT compatible device\n3 even though it does not have a Bluetooth module, an external adapter can be used to connect BT devices with the BT option in settings\nWould recommend buying"
            },
            {
                "date": "21 November 2024",
                "title": "PS5 slim is lit",
                "rating": "5.0 out of 5 stars",
                "text": "Best gaming console"
            },
            {
                "date": "20 January 2025",
                "title": "Seal was not broken. Little bit damaged",
                "rating": "4.0 out of 5 stars",
                "text": "Console is brand new. Was just afraid to order since it had bad reviews. But at 45.25k it is a steal deal. Fortunately i got a good piece too"
            },
            {
                "date": "15 December 2024",
                "title": "Good product Considering ps4 console is still expensive!",
                "rating": "5.0 out of 5 stars",
                "text": "Steal deal Considering that ps4 console is just a few thousand rupees cheaper.\nGames are expensive but that's ok.\nHeat is managed well."
            }
        ]
    },
    {
        "date": "2025-01-24",
        "time": "09:34",
        "title": "Whirlpool 7 Kg 5 Star Royal Fully-Automatic Top Loading Washing Machine (WHITEMAGIC ROYAL 7.0 GENX, Grey, Hard Water Wash, ZPF Technology)",
        "price": "₹14,990",
        "discount": "-6%",
        "sentiment": "Mostly positive, but some negative experiences with delivery, hard water issues, and  missing accessories.\n",
        "reviews": [
            {
                "date": "11 January 2025",
                "title": "Nice product",
                "rating": "5.0 out of 5 stars",
                "text": "Good Product worth money and nice service / installation."
            },
            {
                "date": "18 December 2024",
                "title": "Good But without accessories",
                "rating": "4.0 out of 5 stars",
                "text": "Hi All,\n\nIf you are going to use hard water dont buy this. because it is having hard water wash not water smoothing technology.\nInstallation person will suggest one softner worth 2000 from whrilpool.\nagain they will explain all the accessories in such a way that you will be forced to bye everything like I did. Because no body wantes there product to last less.\nso apart from 15k I spent 5k more for accessories.\n\nstand - they recommend 4 wheel lock iron stand otherwise your drum will vibrate more and may damage soon. = 1525/-\n\nwater softner for better wash and protecting the machine and save you from hard water damages = 2000/-\n\nTheir own Drum cleaner for 9 months and you have to clean once in 45 days = 1400\n\nDetergent which can do the work of vanish, comfort and washing : 350 for 1 ltr (I have taken this just try how it is working)\n\nTotal around 5 k extra.\n\nalthough the machine is good and looks like feature loaded but not recommended to use in Hard water areas like metro cities and all."
            },
            {
                "date": "16 January 2025",
                "title": "Very good products",
                "rating": "5.0 out of 5 stars",
                "text": "Performance very nice...value for money 👌👌👌👌"
            },
            {
                "date": "11 January 2025",
                "title": "Pathetic machine , disgusting product",
                "rating": "1.0 out of 5 stars",
                "text": "I have buyer this product on 22 dec which was delivered to me broken , Amazon’s delivery staff is hurry to get that delivered & leave without completely opened , I call to customer service they suggest me to put this on replacement , which is taken all 19 day to get my replacement machine back , which was delivered 11 jan it was delivered again , now the internal machine system is not working , now Amazon’s team is not provide any solution & asking to return the product again , once again it will take 2 week to get my refund back , wasted of trust , time & money , no solution provided except return"
            },
            {
                "date": "14 January 2025",
                "title": "Value for money product",
                "rating": "5.0 out of 5 stars",
                "text": "Ergonomic design. Good product\n."
            },
            {
                "date": "13 January 2025",
                "title": "Good very much, thank you for",
                "rating": "5.0 out of 5 stars",
                "text": "Hi sir washing machine very good will help you using thank you all"
            },
            {
                "date": "18 January 2025",
                "title": "Good product",
                "rating": "4.0 out of 5 stars",
                "text": "Couldn't download invoice, please address the issue"
            },
            {
                "date": "28 June 2024",
                "title": "Good for the price",
                "rating": "3.0 out of 5 stars",
                "text": "Good things are mention in the product description am listing only Cons compared to samsung 7kg top load bubble wash as I am also using Samsung for 1.5 years\n\nMetal body can catchup corrosion or paint loss over the time and even the small collision creates a dent on the metal body so fiber body would be better option\n\nNo DD (direct drive system) in the Q&A Page it is mentioned that it is direct drive but I got to know that it is not fully direct drive main drive is direct and drum drive is belt so it makes more noise and vibration compared to samsung\n\n5% more vibration and 10% more noise than samsung, anything you do but don't keep the machine on any type of stand or base support stand it will vibrate even more plat surface is better option\n\nHard water wash requires magnetic filter which costs 2000rs extra otherwise hard water wash does not function but in samsung they have built in magnetic filter no need to worry about magnetic filter in samsung\n\nIn any wash mode you select this machine requires more time than samsung\n\nIf you are looking for this product with magnetic filter 2k extra then it is good to go for samsung in the same price range.\n\nDelivery was bit complicated Delivery guy was bit worried to deliver to 1st Floor as my address did not mention the floor number so I had to tip him which is my decision\n\nInstallation experience was wonderful for duct came with no damage and all the functions were working as it should be."
            }
        ]
    },
    {
        "date": "2025-01-24",
        "time": "09:26",
        "title": "Samsung Galaxy S23 Ultra 5G AI Smartphone (Phantom Black, 12GB, 256GB Storage)",
        "price": "₹71,999",
        "discount": "-52%",
        "sentiment": "Overwhelmingly positive;  praised for camera, performance, and display, but some note battery concerns and high price.\n",
        "reviews": [
            {
                "date": "14 October 2024",
                "title": "my experience of using the S23 ultra for 1 onth",
                "rating": "5.0 out of 5 stars",
                "text": "I had switched to the S23 Ultra from the iPhone 13. For me, the S23 Ultra is in a different league compared to the iPhone 13. The cameras are so much better and the telephoto lens of the phone also adds an interesting and useful component to the phone. even when gaming, it gives me 120 fps in most of the games. the display is fantastic and even the charging is adequately fast and reliable. (you need to buy the 45w charger separately.) apart from that, the speakers are fantastic and the haptic feedback is great too. The only major downside I found is that it heats a little bit while you play heavy games and the phone charges slowly while being used. overall, if you can get this phone below 85k now, definitely go for it as it almost has no difference compared to the S24 ultra. The battery backup is also great and 1.5 charging cycles lasts me the entire day. (my average SOT is 10-14 hours). The S pen is also quite handy and is useful occasionally. I would say this is the best all-rounder Android phone you can get if you're looking for a phone below the 100k barrier. Also, the phone will get updates till Android 17 so there is no worry of the OS falling back in time and will run you a good 3 years even if you buy the phone now. Remember that the phone is huge and only buy it if you're comfortable with this form factor or this phone may render as useless to you. go for the regular s23 models if you're not a hardcore user but if you have the budget and requiremnts of the features in this phone i would 100% recommend this phone to you."
            },
            {
                "date": "15 January 2025",
                "title": "Awesome Phone",
                "rating": "5.0 out of 5 stars",
                "text": "Samsung Galaxy S23 Ultra: A Powerhouse of Performance\nThe Samsung Galaxy S23 Ultra is a top-tier smartphone that excels in almost every category. Its standout features include:\n* Incredible Camera: The 200MP main sensor captures stunning photos with incredible detail and dynamic range.\n* Powerful Performance: The Snapdragon 8 Gen 2 processor delivers blazing-fast speeds and smooth multitasking.\n* Vibrant Display: The dynamic AMOLED 2X display boasts incredible brightness, sharp visuals, and smooth scrolling.\n* Long-lasting Battery: The large battery provides all-day endurance, even with heavy usage.\nHowever:\n* Expensive: The S23 Ultra comes with a premium price tag.\n* S Pen can be finicky: Some users find the S Pen integration to be less seamless than advertised.\nOverall:\nThe Samsung Galaxy S23 Ultra is an exceptional smartphone for demanding users. If you're looking for the best of the best and are willing to pay the price, it's a fantastic choice.\nDisclaimer: This is a brief overview. For a more in-depth analysis, please refer to full reviews from reputable tech publications.\nI hope this helps!"
            },
            {
                "date": "31 December 2024",
                "title": "Mobile of the year 2023 and 2024",
                "rating": "5.0 out of 5 stars",
                "text": "Awesome phone just loving it though indont use for gaming etc mainy social media and multiple taskings only and camera and all these area its good..initially i was worried when i got to know that there is no app lock but later after getting used to secure folder secured by knox i am happy with it, display is good is sound is also good connecitvity is alao good and works well with samsung eco system\nWhen i purchased there were very few pieces in the market and i i had to sold old phone and get new one so i got one with a bit higher price...buts a value for money.."
            },
            {
                "date": "19 January 2025",
                "title": "Good but battery issue",
                "rating": "4.0 out of 5 stars",
                "text": "Phone look wise amazing\nGreat camera quality both front and rear value for money\nGreat Touch quality and smoothness\nAI feature is functionality fantastic\n\nBut as far as battery life is concerned draining very fast .....needs to charge twice or thrice a day without any heavy usage of phone\n\nApart from this phn is gud so far"
            },
            {
                "date": "13 September 2024",
                "title": "Go for it",
                "rating": "5.0 out of 5 stars",
                "text": "Samsung S23 Ultra Review\n\nS23 Ultra is a true powerhouse and an impressive flagship device. Here’s a breakdown of the key features and performance:\n\nDesign & Build: The design is sleek and premium with a polished metal frame and glass back. It feels solid in hand, though it’s slightly heavier due to its large size. The curved edges and near-bezel-less display give it a modern, elegant look.\n\nDisplay: The 6.8-inch Dynamic AMOLED 2X display is stunning. Colors are vibrant, blacks are deep, and it offers fantastic brightness even in direct sunlight. The 120Hz refresh rate makes scrolling smooth and the overall experience buttery.\n\nPerformance: Powered by the Snapdragon 8 Gen 2 chipset (or Exynos, depending on the region), this phone can handle anything you throw at it. Whether gaming, multitasking, or using heavy apps, the performance remains snappy without any lags.\n\nCamera: The highlight of the S23 Ultra is its camera setup. The 200MP main sensor captures incredible detail, and the photos in good lighting are rich and sharp. Low-light performance is also top-notch. The 10x optical zoom is another standout feature, allowing for clear shots from afar. It’s ideal for photography enthusiasts.\n\nBattery Life: With a 5000mAh battery, the S23 Ultra comfortably lasts a full day on moderate use. Even with heavy use, you can get through the day without needing a recharge. Fast charging and wireless charging are both supported, though it lacks the ultra-fast charging speeds seen in some competitors.\n\nSoftware: Running on Android 13 with Samsung’s One UI, the experience is smooth and highly customizable. Samsung has also committed to providing long-term software updates, which is a big plus for future-proofing the device.\n\nVerdict: The Samsung S23 Ultra is a premium device with a price tag to match, but it justifies the cost with its exceptional display, powerful performance, and top-tier camera capabilities. If you're looking for a flagship Android phone that excels in nearly every aspect, the S23 Ultra is a strong contender.\n\nPros:\n\nStunning AMOLED display\n\nExceptional camera performance\n\nStrong performance for gaming and multitasking\n\nSolid battery life\n\nCons:\n\nQuite bulky and heavy\n\nExpensive"
            }
        ]
    },
    {
        "date": "2025-01-24",
        "time": "09:26",
        "title": "Apple iPhone 15 (512 GB) - Black",
        "price": "₹87,999",
        "discount": "-20%",
        "sentiment": "Overwhelmingly positive; users praise design, performance, and camera, but some cite battery concerns and pricing.\n",
        "reviews": [
            {
                "date": "6 October 2023",
                "title": "iPhone 15 A solid upgrade and value for money",
                "rating": "5.0 out of 5 stars",
                "text": "Design\nOne of the most noticeable changes to the iPhone 15 is its new design. The phone now has rounded edges, which makes it feel more comfortable in the hand. It also has a new camera bump that is less pronounced than the one on the iPhone 14.\n\nDisplay\nThe iPhone 15 has the same 6.1-inch Super Retina XDR display as the iPhone 14. However, the new display is brighter and has better contrast. It also supports HDR10 and Dolby Vision.\n\nPerformance\nThe iPhone 15 is powered by the new A16 Bionic chip, which is the fastest mobile chip on the market. The A16 Bionic chip is up to 20% faster than the A15 Bionic chip in the iPhone 14.\n\nCamera\nThe iPhone 15 has a new 48-megapixel main camera. The new camera sensor is larger than the one in the iPhone 14, and it has better low-light performance. The iPhone 15 also has a new 12-megapixel ultrawide camera and a new 12-megapixel telephoto camera.\n\nBattery life\nThe iPhone 15 has the same battery life as the iPhone 14. This means that you can expect to get around a day of use on a single charge. Overall The iPhone 15 is a solid upgrade over the iPhone 14.\n\nPros\nNew design with rounded edges\nMore powerful A16 Bionic chip found in 14 pro\nNew 48-megapixel main camera\nBrighter display with upto 2000 nits brightness\nUSB C can be used for anything\nDynamic Island\n\nCons\nNo 120hz display\nNo Macro photography"
            },
            {
                "date": "15 January 2025",
                "title": "Awesome product..value for money.",
                "rating": "5.0 out of 5 stars",
                "text": "Awesome stuff at a very affordable rate. Looks are amazing, functions superlative and feel to hold it is, smooooth...GO for it- product."
            },
            {
                "date": "24 July 2024",
                "title": "Iphone from Apple as usual top in quality and experiance.",
                "rating": "5.0 out of 5 stars",
                "text": "First of it looks very very prime quality and nicely fit in your hands. I am an android user still I don't face issue at the time of operating. In India you have to download required apps from app store free of cost. Apple store not available in India. You can use two sim , one physical micro sim and other esim. Conversion of physical micro sim to esim is very easy and happen in just two hours from your home. But after conversion sms service restricted for 24 hours as per guidelines if TRAI. No issue of connectivity if you have good network strength of your desired operator. Very crispy screen gives no strain on your eyes. Battery life is awesome , 1 one day for heavy user and 2 days for light user. Smooth performance of IOS system, no lags ,no glitches , not a single problem when you get to use. Sound is also very big but very crystal clear. Value is on high side, so though it is very good in all aspects, many people may find it very difficult to purchase ."
            },
            {
                "date": "16 January 2025",
                "title": "Jusstttt awesome 👍🎀..",
                "rating": "4.0 out of 5 stars",
                "text": ""
            },
            {
                "date": "7 October 2023",
                "title": "iPhone XR to iPhone 15",
                "rating": "5.0 out of 5 stars",
                "text": "Just made the transition and here’s my POV on the first ~2 month of use\n\nPros\n- Battery Life is awesome, easily get about a day plus on this, so no Compliants\n- Screen fluidity is smooooooth! Understandable as I’m transitioning into an OLED from LCD in XR. The panel gets a solid peak brightness quotient so happy here\n- Screen brightness is good as compared to XR, 2200 nits, but I hardly go beyond 30% brightness to save some juice. Whilst outside I did crank it up and it’s spotless\n- Dynamic Island is fun, yet to use it to the fullest. Like the way it shows the ETA on delivery and Uber. Simple solution instead of you having to get into the app to check on the ETA\n- Weight, this phone is soo bloody light!! Understandable as XR was a brick, this is soo welcome\n- Camera is awesome, love the 48MP intervention, the portrait mode and cinematic mode does the job for me.\n- The Apple eco system, I enjoy seamless integration of my Watch, Mac, IPad Air and IPhone\n- Apples approach on Security!\n- Transferring data from my XR to 15 using the built in app is flawless\n\nCons\n- The phone was over heating , there is a solution to this from Apple = back up the phone and then erase and reset the phone… including your eSIM settings.. once done set up the phone with the back up….. works like a charm\n- I still believe Apple should have thrown in a charging brick with such purchases\n\nIndustry memes\n- USB C : honestly don’t give a jack for the reviews out there on this. It’s just a mode of charging for me and that’s it. I’m not going to be transferring any data so yea, 2.0 speed yadadada - thank you so much\n- Blue is not blue but white! Think people whining about this should go back to 13/14 or those ludicrous blues in Androids!! These are pestle shades people!!\n- Buying an Apple product to show off!! I mean, you even serious? You buy a product and then comment on why you should not buy one?\n- 60hz refresh rate for a 80k phone : save your jokes people, there are many of us who appreciate quality and security than how the screen refreshes. For non gamers like me, panel that is here is apt. I’ve seen a ton of folks buying 120hz phones and using it only to make calls, watch some videos and for texting\n\nTips of managing battery health\n- Switch off background app refresh for apps you don’t need back ground refresh\n- Avoid wireless charging as this heats your devise up\n- I charge my phone only using a power bank not direct wired or wireless charging\n- Don’t let the battery go below 20%, keep it always between 95% and 20%\n- Switch off location services and allow only certain app that needs your location service\n- Switch on Charging Optimisation under the battery section\n- I don’t use vibrate mode for rings/incoming calls etc\n- My XR after 5 years of use has 86% battery health so I guess I know what I’m recommending above\n\nVendor Experience : Appario Retail Private Limited. 5/5, been a regular customer and they have never disappointed me even once. The purchase experience is breezy and quick, thanks team for the support and look forward to the collaboration in the future.\n\n….. watch out for this space. Will keep updating in case of significant change in experience"
            },
            {
                "date": "11 January 2025",
                "title": "Excellent.",
                "rating": "5.0 out of 5 stars",
                "text": "Fast Charging.It is very smooth.sound is boost.Its perfomance is excellent.its functions are pour."
            },
            {
                "date": "19 January 2025",
                "title": "Great choice",
                "rating": "5.0 out of 5 stars",
                "text": "Excellent phone. Value for money."
            },
            {
                "date": "12 October 2023",
                "title": "It's about the great iPhone 15",
                "rating": "4.0 out of 5 stars",
                "text": "Everyone know about pros , let's only talk about cons\nBattery : worst than I expect . Many says it is iOS 17 behind poor battery life . Hardly 3-4 he if you travelling and your network changes frequently .. worst than my android devices .\nPerformance : no doubt in performance , it's the best in the industry ,\nCamera : undoubtably very good in camera dipartment but I hardly take photos 😁\niOS : verry smooth and many good things are missing . Call recording , call pick up haptic , smart dial and many more little but verry important feature ..\nMany youtuber says there is no such use of dynamic island but listen to me it is verry usefull and looking cool too\nPrice : obviously it's not value for money but it's far better than 13 and 14 launch price which is same . Although this time iPhone 15 far better than 15 pro"
            }
        ]
    },
    {
        "date": "2025-01-24",
        "time": "09:26",
        "title": "Sony Digital Camera ZV-1 Only (Compact, Video Eye AF, Flip Screen, in-Built Microphone, 4K Vlogging Camera for Content Creation) - Black",
        "price": "₹49,990",
        "discount": "-26%",
        "sentiment": "Mostly positive; praised for video quality and autofocus, but criticized for battery life and price.\n",
        "reviews": [
            {
                "date": "28 January 2023",
                "title": "Impressive camera for videos and vlogging",
                "rating": "5.0 out of 5 stars",
                "text": "I bought ZV-1 for making videos for my YouTube channel and Instagram. The camera captures good 4K videos and has good stabilization. It also smoothes skin, a kind of beauty mode to make you look good in videos.\n\nThe autofocus is also really good. Features like Product Showcase and Background Defocus also make it better. If you need a compact camera for vlogging, get it. This camera is not good for photos. It also lacks longer zoom range. In case you want a camera that can also capture good photos, avoid it. Consider it as a video camera only."
            },
            {
                "date": "12 August 2022",
                "title": "Excellent travel camera",
                "rating": "4.0 out of 5 stars",
                "text": "Like all modern sony cameras, you gotta know to a certain extent what you're doing to get the most out of the cameras. To be fair, this applies to all cameras including smartphone cameras, but that's beside the point.\nAnyway, this camera was released about 2 years ago at the time of me writing this. I bought it for someone else, as it fit the budget and it has all the features that they'll need. I did have a day to test it out and the TLDR is that it's a very easy recommendation for anyone who wants a compact camera that can take excellent stills and videos but doesn't need a huge zoom range.\n\nMy primary digital camera is a sony a6600, and the zv-1 has a very similar image quality to that. Both in video and photo modes. The a6600 of course has more dynamic range and better low light but that camera also costs a little over twice as much as this one and both serve different demographics.\n\nThe zv-1 has an adequately fast (i.e. wide aperture) lens with equivalent focal length of 24-70mm, which is a solid range for most things. The lens is sharp throughout the zoom range and has very little defects (defects as in chromatic aberration, distortion, vignette etc.).\n\nThe video quality is excellent. If you know your way around any NLE, I'd recommend shooting in 4k @100mbps always and with a custom picture profile with gamma set to s-log2 and gamut set to itu709. Set detail to the lowest possible value (-7). That, i find, to be the optimal setting for the low bitrate 8bit footage. If you don't want to do post processing, perhaps I'd suggest using no picture profile but turning up DRO to max.\n\nThe cons would include a very short battery life. However, the camera can be powered indefinitely with a power bank. I reckon it's an acceptable tradeoff for the tiny footprint of the camera. Speaking of which, you might also wanna get a strap for it as it doesn't come with one and if you have bigger hands like i do, there's definitely a risk of it falling.\n\nI didn't have time to do super thorough tests, but from what I've seen, I think I can easily recommend this camera to anyone who wouldn't mind the limitations of it. The primary limitations being a smaller sensor size, fixed lens and a small battery.\n\nOh, and it doesn't have a flash built in but I kinda prefer not having a built in flash because i never use it and it's just one more thing waiting to break."
            },
            {
                "date": "25 October 2020",
                "title": "Beginner friendly ZV1",
                "rating": "5.0 out of 5 stars",
                "text": "Best camera you can buy as a content creator!\n\nI always confused between Canon m50 or Sony ZV1. Atleast choose the ZV1. Because of these resons,\n1. Great Autofocus ( Very very useful. Sony cameras are very reliable)\n\n2. Quality (Sony smashed Canon)\n\n3. Less croped, usable 4k recording ( As compared to m50)\n\n4. Low light capability (Much much better than m50)\n\n5. Value for money ( I calculted overall cost to get the same things from M50, and it cost more than ZV1)\n\nBut, yes there have two major drawbacks,\n1. Battery (Yes you'll get more battery life in m50 compared to ZV1)\n\n2. 24mm lens ( I think 16mm is the best lens for vlogging and you can buy one for M50. For ZV1, yes it's 24mm is wide but not as much as you need for vlogging.)\n\nConclusion - If you need Quality, reliability and compactability just like me, this is the camera you need.\n\nNo other camera on the market can beat it in this price point."
            },
            {
                "date": "22 October 2020",
                "title": "Just the Camera a new Youtuber needed... Blindly u can go for this Camera",
                "rating": "5.0 out of 5 stars",
                "text": "Award winning Autofocus Sony lens alongwith rotating screen with Background Defocus what can u expect more on a camera for Vlogging.\n\nPros :-\nCompact\nEase to operate\nBackground defocus\nflip screen\nmicrophone jack and clamp\n4K and slow motion recording\nPAL & NTSC mode\nSexy slim look\nEye tracking autofocus\nProduct Showcase mode\n\nCons:-\nNo touch screen\nBattery is less\nBeauty mode\nND Filter\nGood Stabilization feature (Standard & Active)\nno fast charging\n\nBest for new YT creator with budget and also for Pro YT for review videos.\nI am happy with the investment... Must have for videos and photos...\nNo phone can match this camera clarity"
            },
            {
                "date": "9 October 2024",
                "title": "Worst camera.",
                "rating": "1.0 out of 5 stars",
                "text": "Its quality is consistently worse than my iPhone 14. It even gets froze sometime."
            },
            {
                "date": "11 January 2021",
                "title": "Tiny power house, good for travel and exciting travel photography",
                "rating": "5.0 out of 5 stars",
                "text": "Ordered cam at the earliest. Tested its functionality, operating excellent. Pleased with the size and power packed in it. Only downside is \"had the lens covered wider\"! Can manage with Ulanzi extended mt 08 tripod stick. Hope to enjoy vlog and travel."
            },
            {
                "date": "26 October 2022",
                "title": "Overall a good camera👍 But...👇",
                "rating": "4.0 out of 5 stars",
                "text": "Q. Is it worth 54k?\nNo, should have been around 40k given that it's from \"2020\" & 2023 is almost here.\n\nQ. Is it easy to use?\nYes, if you're a little experienced & No, if you're a first timer, so make sure you watch those tutorials first.\n\nQ. Is it good for social media & especially YT?\nYes! A 100%.\nUPDATE: The camera is out of the box updated to the latest firmware, so you don't need to update it... Seems a little suspicious.\n\nI liked the camera! Not the price tho!\n🙂👍"
            },
            {
                "date": "2 September 2022",
                "title": "Better only for close up shoots",
                "rating": "5.0 out of 5 stars",
                "text": "No doubt this camera is amazing but it is only for front facing vlogging purpose only. You need to keep your face close to the camera for focus or else it records normal footage. Battery drains within 30 minutes. So I bought two extra batteries for it. As per the price, it's not worth. Someone should go with Sony zv e10 instead."
            }
        ]
    },
    {
        "date": "2025-01-24",
        "time": "09:26",
        "title": "Lenovo ThinkPad E14 Intel Core i3 13th Gen 14\" WUXGA IPS 300 Nits Thin and Light Laptop (8GB RAM/512GB SSD/Windows 11 Home/FPR/Black/1Y Onsite/1.41 kg), 21JKS13L00",
        "price": "₹48,590",
        "discount": "-45%",
        "sentiment": "Mixed sentiment; mostly positive, but some reports of defects and poor customer service.\n",
        "reviews": [
            {
                "date": "7 November 2024",
                "title": "value for money",
                "rating": "5.0 out of 5 stars",
                "text": "value for money"
            },
            {
                "date": "27 July 2024",
                "title": "Good",
                "rating": "3.0 out of 5 stars",
                "text": "Bit confusing discription for those who uses broad screen like 15 inch width, the actual screen size of this laptop is 16 inch diagonal and 14 inch width. Overall it is working good and fast."
            },
            {
                "date": "21 November 2024",
                "title": "USB and HDMI Port Issue",
                "rating": "1.0 out of 5 stars",
                "text": "HDMI Port Not working after 15 Days. Service center re directing to local service station telling Motherboard need to be replaced, without checking Laptop !"
            },
            {
                "date": "30 January 2023",
                "title": "It's very good Laptop... I am very satisfied in this Device",
                "rating": "5.0 out of 5 stars",
                "text": "I liked the anti glare screen quality of the laptop. Lenovo has a very good laptop 💻👍"
            },
            {
                "date": "6 October 2022",
                "title": "Owesome",
                "rating": "5.0 out of 5 stars",
                "text": "Very good product if it's fits in your budget must go for it"
            },
            {
                "date": "23 October 2024",
                "title": "Great Laptop",
                "rating": "5.0 out of 5 stars",
                "text": "Super laptop, now i understand what the hype around ThinkPad really is.\n\nIt is worth the premium price!!\n\n10/10 recommend"
            },
            {
                "date": "1 January 2023",
                "title": "Performer laptop, value for money",
                "rating": "3.0 out of 5 stars",
                "text": "I am happy with the laptop, since you get what you paid for.\nExpect these in this laptop:\n1. No Kayboard light\n2. Though it says that the display is HD, but the display is not upto the mark. Colour looks different when you change the viewing angle.\n3. Sound quality is quite good\n4. Battery life is moderate. My other i5 thinkpad lasts longer with similar usage. Charges pretty fast with its 65watt charger\n5. It is slightly heavy due to it's metal body"
            },
            {
                "date": "18 October 2024",
                "title": "Amazon se khari nahi kare fraud karta hai sawdhan ho jaye Amazon se",
                "rating": "1.0 out of 5 stars",
                "text": " "
            }
        ]
    },
    {
        "date": "2025-01-24",
        "time": "09:26",
        "title": "Sony PlayStation®5 Console (slim)",
        "price": "₹54,990",
        "discount": "None",
        "sentiment": "Overwhelmingly positive;  minor concerns about seller responsiveness and product age in a few reviews.\n",
        "reviews": [
            {
                "date": "29 June 2024",
                "title": "Impressive Upgrade to the Gaming Experience 😍😍😍😍",
                "rating": "5.0 out of 5 stars",
                "text": "As an avid gamer, I recently upgraded to the PS5 Slim, and I must say, it has completely transformed my gaming experience. Here’s why I think the PS5 Slim is a fantastic choice:\n\n**Performance:** The PS5 Slim delivers breathtaking performance with its lightning-fast load times and seamless gameplay. Whether I'm exploring vast open worlds or engaging in intense multiplayer battles, the console handles everything effortlessly.\n\n**Graphics:** The visuals are simply stunning. The 4K resolution and HDR capabilities bring games to life with vibrant colors and incredible detail. Every frame feels like a work of art, enhancing immersion and making every gaming session unforgettable.\n\n**Controller:** The DualSense controller is a game-changer. The adaptive triggers and haptic feedback add a new layer of realism to games, allowing me to feel every action and movement in a way that was never possible before. It truly enhances the gameplay experience.\n\n**Design:** The PS5 Slim’s sleek and compact design fits perfectly into my gaming setup. It’s not only aesthetically pleasing but also practical, with improved cooling systems that ensure the console stays quiet and cool even during extended gaming sessions.\n\n**Game Library:** With a vast library of exclusive titles and backward compatibility with PS4 games, there's no shortage of games to play on the PS5 Slim. From blockbuster AAA titles to indie gems, there’s something for every type of gamer.\n\n**User Interface:** Navigating the user interface is smooth and intuitive, allowing me to switch between games, apps, and media seamlessly. The interface is designed to prioritize the gaming experience, making it easy to find what I want quickly.\n\n**Overall Experience:** In conclusion, the PS5 Slim has exceeded my expectations in every way. It’s not just a gaming console; it’s a gateway to new adventures and unforgettable experiences. Whether you’re a casual gamer or a hardcore enthusiast, the PS5 Slim is definitely worth every penny. Highly recommended!"
            },
            {
                "date": "5 December 2024",
                "title": "100% Original Product!",
                "rating": "5.0 out of 5 stars",
                "text": "It's a genuine Sony product of Indian variety. The seller is reliable in the sense that I have recieved a genuine Sony PS5 Slim console (disc edition) in perfect condition that opens up new vistas in the world of gaming. This console is a must-have asset for pro and normal gamers. But, one thing to note, please don't expect any after-sales-support from the seller, as I have experienced in my case, when I observed that the yellow warranty card, meant for India, was missing in the console's package, and contacted the seller for support, and unfortunately received no response! Then, I contacted Sony India customer care both over the phone and email, sent the copy of the invoice as generated by the seller, a snapshot of the serial number on the bottom side of the company box, as well as the serial number on the bottom side of the console itself. Next, within a few days, the warranty card was sent by Sony through courier to my residence. Kudos for Sony for this wonderful service! Wish the seller had been equally responsible and prompt in handling customers' issues. However, at the end I hope everything will go well and extend my heartfelt thanks to the seller and Sony for their respective services."
            },
            {
                "date": "29 December 2024",
                "title": "Delivery on-time",
                "rating": "5.0 out of 5 stars",
                "text": "It was delivered on-time. Product is new and in good quality. Seller:e2zStore."
            },
            {
                "date": "28 November 2024",
                "title": "The manufacturing date is 1 year old. I.e Nov’24",
                "rating": "1.0 out of 5 stars",
                "text": "I ordered the slim version on 24th Nov’24 and got delivery on 26th. If the slim version is launched in India in Apr’24, how come I got a slim version manufactured in Nov’23? One year old product.\nCan anyone help? Should I return the product\nPlz"
            },
            {
                "date": "2 January 2025",
                "title": "Best console ever . Worth the Money",
                "rating": "5.0 out of 5 stars",
                "text": "The packaging was perfectly intact. The ps5’s box was shipped in a very spacious cardboard box.Unboxing was very satisfying.Functionalities:\n1 Very powerful. It can handle NFS Unbound smoothly at 4K 60fps with HDR\n2 The dual sense controller can also be used as a normal controller for any BT compatible device\n3 even though it does not have a Bluetooth module, an external adapter can be used to connect BT devices with the BT option in settings\nWould recommend buying"
            },
            {
                "date": "21 November 2024",
                "title": "PS5 slim is lit",
                "rating": "5.0 out of 5 stars",
                "text": "Best gaming console"
            },
            {
                "date": "20 January 2025",
                "title": "Seal was not broken. Little bit damaged",
                "rating": "4.0 out of 5 stars",
                "text": "Console is brand new. Was just afraid to order since it had bad reviews. But at 45.25k it is a steal deal. Fortunately i got a good piece too"
            },
            {
                "date": "15 December 2024",
                "title": "Good product Considering ps4 console is still expensive!",
                "rating": "5.0 out of 5 stars",
                "text": "Steal deal Considering that ps4 console is just a few thousand rupees cheaper.\nGames are expensive but that's ok.\nHeat is managed well."
            }
        ]
    },
    {
        "date": "2025-01-24",
        "time": "09:26",
        "title": "Whirlpool 7 Kg 5 Star Royal Fully-Automatic Top Loading Washing Machine (WHITEMAGIC ROYAL 7.0 GENX, Grey, Hard Water Wash, ZPF Technology)",
        "price": "₹14,990",
        "discount": "-6%",
        "sentiment": "Mixed reviews;  positive comments praise performance and value, while negative reviews cite delivery issues,  hard water problems, and  high accessory costs.\n",
        "reviews": [
            {
                "date": "11 January 2025",
                "title": "Nice product",
                "rating": "5.0 out of 5 stars",
                "text": "Good Product worth money and nice service / installation."
            },
            {
                "date": "18 December 2024",
                "title": "Good But without accessories",
                "rating": "4.0 out of 5 stars",
                "text": "Hi All,\n\nIf you are going to use hard water dont buy this. because it is having hard water wash not water smoothing technology.\nInstallation person will suggest one softner worth 2000 from whrilpool.\nagain they will explain all the accessories in such a way that you will be forced to bye everything like I did. Because no body wantes there product to last less.\nso apart from 15k I spent 5k more for accessories.\n\nstand - they recommend 4 wheel lock iron stand otherwise your drum will vibrate more and may damage soon. = 1525/-\n\nwater softner for better wash and protecting the machine and save you from hard water damages = 2000/-\n\nTheir own Drum cleaner for 9 months and you have to clean once in 45 days = 1400\n\nDetergent which can do the work of vanish, comfort and washing : 350 for 1 ltr (I have taken this just try how it is working)\n\nTotal around 5 k extra.\n\nalthough the machine is good and looks like feature loaded but not recommended to use in Hard water areas like metro cities and all."
            },
            {
                "date": "16 January 2025",
                "title": "Very good products",
                "rating": "5.0 out of 5 stars",
                "text": "Performance very nice...value for money 👌👌👌👌"
            },
            {
                "date": "11 January 2025",
                "title": "Pathetic machine , disgusting product",
                "rating": "1.0 out of 5 stars",
                "text": "I have buyer this product on 22 dec which was delivered to me broken , Amazon’s delivery staff is hurry to get that delivered & leave without completely opened , I call to customer service they suggest me to put this on replacement , which is taken all 19 day to get my replacement machine back , which was delivered 11 jan it was delivered again , now the internal machine system is not working , now Amazon’s team is not provide any solution & asking to return the product again , once again it will take 2 week to get my refund back , wasted of trust , time & money , no solution provided except return"
            },
            {
                "date": "14 January 2025",
                "title": "Value for money product",
                "rating": "5.0 out of 5 stars",
                "text": "Ergonomic design. Good product\n."
            },
            {
                "date": "13 January 2025",
                "title": "Good very much, thank you for",
                "rating": "5.0 out of 5 stars",
                "text": "Hi sir washing machine very good will help you using thank you all"
            },
            {
                "date": "18 January 2025",
                "title": "Good product",
                "rating": "4.0 out of 5 stars",
                "text": "Couldn't download invoice, please address the issue"
            },
            {
                "date": "28 June 2024",
                "title": "Good for the price",
                "rating": "3.0 out of 5 stars",
                "text": "Good things are mention in the product description am listing only Cons compared to samsung 7kg top load bubble wash as I am also using Samsung for 1.5 years\n\nMetal body can catchup corrosion or paint loss over the time and even the small collision creates a dent on the metal body so fiber body would be better option\n\nNo DD (direct drive system) in the Q&A Page it is mentioned that it is direct drive but I got to know that it is not fully direct drive main drive is direct and drum drive is belt so it makes more noise and vibration compared to samsung\n\n5% more vibration and 10% more noise than samsung, anything you do but don't keep the machine on any type of stand or base support stand it will vibrate even more plat surface is better option\n\nHard water wash requires magnetic filter which costs 2000rs extra otherwise hard water wash does not function but in samsung they have built in magnetic filter no need to worry about magnetic filter in samsung\n\nIn any wash mode you select this machine requires more time than samsung\n\nIf you are looking for this product with magnetic filter 2k extra then it is good to go for samsung in the same price range.\n\nDelivery was bit complicated Delivery guy was bit worried to deliver to 1st Floor as my address did not mention the floor number so I had to tip him which is my decision\n\nInstallation experience was wonderful for duct came with no damage and all the functions were working as it should be."
            }
        ]
    },
    {
        "date": "2025-01-24",
        "time": "02:30",
        "title": "Apple iPhone 15 (512 GB) - Black",
        "price": "₹87,999",
        "discount": "-20%",
        "reviews": [
            {
                "date": "6 October 2023",
                "title": "iPhone 15 A solid upgrade and value for money",
                "rating": "5.0 out of 5 stars",
                "text": "Design\nOne of the most noticeable changes to the iPhone 15 is its new design. The phone now has rounded edges, which makes it feel more comfortable in the hand. It also has a new camera bump that is less pronounced than the one on the iPhone 14.\n\nDisplay\nThe iPhone 15 has the same 6.1-inch Super Retina XDR display as the iPhone 14. However, the new display is brighter and has better contrast. It also supports HDR10 and Dolby Vision.\n\nPerformance\nThe iPhone 15 is powered by the new A16 Bionic chip, which is the fastest mobile chip on the market. The A16 Bionic chip is up to 20% faster than the A15 Bionic chip in the iPhone 14.\n\nCamera\nThe iPhone 15 has a new 48-megapixel main camera. The new camera sensor is larger than the one in the iPhone 14, and it has better low-light performance. The iPhone 15 also has a new 12-megapixel ultrawide camera and a new 12-megapixel telephoto camera.\n\nBattery life\nThe iPhone 15 has the same battery life as the iPhone 14. This means that you can expect to get around a day of use on a single charge. Overall The iPhone 15 is a solid upgrade over the iPhone 14.\n\nPros\nNew design with rounded edges\nMore powerful A16 Bionic chip found in 14 pro\nNew 48-megapixel main camera\nBrighter display with upto 2000 nits brightness\nUSB C can be used for anything\nDynamic Island\n\nCons\nNo 120hz display\nNo Macro photography"
            },
            {
                "date": "15 January 2025",
                "title": "Awesome product..value for money.",
                "rating": "5.0 out of 5 stars",
                "text": "Awesome stuff at a very affordable rate. Looks are amazing, functions superlative and feel to hold it is, smooooth...GO for it- product."
            },
            {
                "date": "24 July 2024",
                "title": "Iphone from Apple as usual top in quality and experiance.",
                "rating": "5.0 out of 5 stars",
                "text": "First of it looks very very prime quality and nicely fit in your hands. I am an android user still I don't face issue at the time of operating. In India you have to download required apps from app store free of cost. Apple store not available in India. You can use two sim , one physical micro sim and other esim. Conversion of physical micro sim to esim is very easy and happen in just two hours from your home. But after conversion sms service restricted for 24 hours as per guidelines if TRAI. No issue of connectivity if you have good network strength of your desired operator. Very crispy screen gives no strain on your eyes. Battery life is awesome , 1 one day for heavy user and 2 days for light user. Smooth performance of IOS system, no lags ,no glitches , not a single problem when you get to use. Sound is also very big but very crystal clear. Value is on high side, so though it is very good in all aspects, many people may find it very difficult to purchase ."
            },
            {
                "date": "16 January 2025",
                "title": "Jusstttt awesome 👍🎀..",
                "rating": "4.0 out of 5 stars",
                "text": ""
            },
            {
                "date": "7 October 2023",
                "title": "iPhone XR to iPhone 15",
                "rating": "5.0 out of 5 stars",
                "text": "Just made the transition and here’s my POV on the first ~2 month of use\n\nPros\n- Battery Life is awesome, easily get about a day plus on this, so no Compliants\n- Screen fluidity is smooooooth! Understandable as I’m transitioning into an OLED from LCD in XR. The panel gets a solid peak brightness quotient so happy here\n- Screen brightness is good as compared to XR, 2200 nits, but I hardly go beyond 30% brightness to save some juice. Whilst outside I did crank it up and it’s spotless\n- Dynamic Island is fun, yet to use it to the fullest. Like the way it shows the ETA on delivery and Uber. Simple solution instead of you having to get into the app to check on the ETA\n- Weight, this phone is soo bloody light!! Understandable as XR was a brick, this is soo welcome\n- Camera is awesome, love the 48MP intervention, the portrait mode and cinematic mode does the job for me.\n- The Apple eco system, I enjoy seamless integration of my Watch, Mac, IPad Air and IPhone\n- Apples approach on Security!\n- Transferring data from my XR to 15 using the built in app is flawless\n\nCons\n- The phone was over heating , there is a solution to this from Apple = back up the phone and then erase and reset the phone… including your eSIM settings.. once done set up the phone with the back up….. works like a charm\n- I still believe Apple should have thrown in a charging brick with such purchases\n\nIndustry memes\n- USB C : honestly don’t give a jack for the reviews out there on this. It’s just a mode of charging for me and that’s it. I’m not going to be transferring any data so yea, 2.0 speed yadadada - thank you so much\n- Blue is not blue but white! Think people whining about this should go back to 13/14 or those ludicrous blues in Androids!! These are pestle shades people!!\n- Buying an Apple product to show off!! I mean, you even serious? You buy a product and then comment on why you should not buy one?\n- 60hz refresh rate for a 80k phone : save your jokes people, there are many of us who appreciate quality and security than how the screen refreshes. For non gamers like me, panel that is here is apt. I’ve seen a ton of folks buying 120hz phones and using it only to make calls, watch some videos and for texting\n\nTips of managing battery health\n- Switch off background app refresh for apps you don’t need back ground refresh\n- Avoid wireless charging as this heats your devise up\n- I charge my phone only using a power bank not direct wired or wireless charging\n- Don’t let the battery go below 20%, keep it always between 95% and 20%\n- Switch off location services and allow only certain app that needs your location service\n- Switch on Charging Optimisation under the battery section\n- I don’t use vibrate mode for rings/incoming calls etc\n- My XR after 5 years of use has 86% battery health so I guess I know what I’m recommending above\n\nVendor Experience : Appario Retail Private Limited. 5/5, been a regular customer and they have never disappointed me even once. The purchase experience is breezy and quick, thanks team for the support and look forward to the collaboration in the future.\n\n….. watch out for this space. Will keep updating in case of significant change in experience"
            },
            {
                "date": "11 January 2025",
                "title": "Excellent.",
                "rating": "5.0 out of 5 stars",
                "text": "Fast Charging.It is very smooth.sound is boost.Its perfomance is excellent.its functions are pour."
            },
            {
                "date": "19 January 2025",
                "title": "Great choice",
                "rating": "5.0 out of 5 stars",
                "text": "Excellent phone. Value for money."
            },
            {
                "date": "12 October 2023",
                "title": "It's about the great iPhone 15",
                "rating": "4.0 out of 5 stars",
                "text": "Everyone know about pros , let's only talk about cons\nBattery : worst than I expect . Many says it is iOS 17 behind poor battery life . Hardly 3-4 he if you travelling and your network changes frequently .. worst than my android devices .\nPerformance : no doubt in performance , it's the best in the industry ,\nCamera : undoubtably very good in camera dipartment but I hardly take photos 😁\niOS : verry smooth and many good things are missing . Call recording , call pick up haptic , smart dial and many more little but verry important feature ..\nMany youtuber says there is no such use of dynamic island but listen to me it is verry usefull and looking cool too\nPrice : obviously it's not value for money but it's far better than 13 and 14 launch price which is same . Although this time iPhone 15 far better than 15 pro"
            }
        ]
    },
    {
        "date": "2025-01-24",
        "time": "02:30",
        "title": "Sony Digital Camera ZV-1 Only (Compact, Video Eye AF, Flip Screen, in-Built Microphone, 4K Vlogging Camera for Content Creation) - Black",
        "price": "₹49,990",
        "discount": "-26%",
        "reviews": [
            {
                "date": "28 January 2023",
                "title": "Impressive camera for videos and vlogging",
                "rating": "5.0 out of 5 stars",
                "text": "I bought ZV-1 for making videos for my YouTube channel and Instagram. The camera captures good 4K videos and has good stabilization. It also smoothes skin, a kind of beauty mode to make you look good in videos.\n\nThe autofocus is also really good. Features like Product Showcase and Background Defocus also make it better. If you need a compact camera for vlogging, get it. This camera is not good for photos. It also lacks longer zoom range. In case you want a camera that can also capture good photos, avoid it. Consider it as a video camera only."
            },
            {
                "date": "12 August 2022",
                "title": "Excellent travel camera",
                "rating": "4.0 out of 5 stars",
                "text": "Like all modern sony cameras, you gotta know to a certain extent what you're doing to get the most out of the cameras. To be fair, this applies to all cameras including smartphone cameras, but that's beside the point.\nAnyway, this camera was released about 2 years ago at the time of me writing this. I bought it for someone else, as it fit the budget and it has all the features that they'll need. I did have a day to test it out and the TLDR is that it's a very easy recommendation for anyone who wants a compact camera that can take excellent stills and videos but doesn't need a huge zoom range.\n\nMy primary digital camera is a sony a6600, and the zv-1 has a very similar image quality to that. Both in video and photo modes. The a6600 of course has more dynamic range and better low light but that camera also costs a little over twice as much as this one and both serve different demographics.\n\nThe zv-1 has an adequately fast (i.e. wide aperture) lens with equivalent focal length of 24-70mm, which is a solid range for most things. The lens is sharp throughout the zoom range and has very little defects (defects as in chromatic aberration, distortion, vignette etc.).\n\nThe video quality is excellent. If you know your way around any NLE, I'd recommend shooting in 4k @100mbps always and with a custom picture profile with gamma set to s-log2 and gamut set to itu709. Set detail to the lowest possible value (-7). That, i find, to be the optimal setting for the low bitrate 8bit footage. If you don't want to do post processing, perhaps I'd suggest using no picture profile but turning up DRO to max.\n\nThe cons would include a very short battery life. However, the camera can be powered indefinitely with a power bank. I reckon it's an acceptable tradeoff for the tiny footprint of the camera. Speaking of which, you might also wanna get a strap for it as it doesn't come with one and if you have bigger hands like i do, there's definitely a risk of it falling.\n\nI didn't have time to do super thorough tests, but from what I've seen, I think I can easily recommend this camera to anyone who wouldn't mind the limitations of it. The primary limitations being a smaller sensor size, fixed lens and a small battery.\n\nOh, and it doesn't have a flash built in but I kinda prefer not having a built in flash because i never use it and it's just one more thing waiting to break."
            },
            {
                "date": "25 October 2020",
                "title": "Beginner friendly ZV1",
                "rating": "5.0 out of 5 stars",
                "text": "Best camera you can buy as a content creator!\n\nI always confused between Canon m50 or Sony ZV1. Atleast choose the ZV1. Because of these resons,\n1. Great Autofocus ( Very very useful. Sony cameras are very reliable)\n\n2. Quality (Sony smashed Canon)\n\n3. Less croped, usable 4k recording ( As compared to m50)\n\n4. Low light capability (Much much better than m50)\n\n5. Value for money ( I calculted overall cost to get the same things from M50, and it cost more than ZV1)\n\nBut, yes there have two major drawbacks,\n1. Battery (Yes you'll get more battery life in m50 compared to ZV1)\n\n2. 24mm lens ( I think 16mm is the best lens for vlogging and you can buy one for M50. For ZV1, yes it's 24mm is wide but not as much as you need for vlogging.)\n\nConclusion - If you need Quality, reliability and compactability just like me, this is the camera you need.\n\nNo other camera on the market can beat it in this price point."
            },
            {
                "date": "22 October 2020",
                "title": "Just the Camera a new Youtuber needed... Blindly u can go for this Camera",
                "rating": "5.0 out of 5 stars",
                "text": "Award winning Autofocus Sony lens alongwith rotating screen with Background Defocus what can u expect more on a camera for Vlogging.\n\nPros :-\nCompact\nEase to operate\nBackground defocus\nflip screen\nmicrophone jack and clamp\n4K and slow motion recording\nPAL & NTSC mode\nSexy slim look\nEye tracking autofocus\nProduct Showcase mode\n\nCons:-\nNo touch screen\nBattery is less\nBeauty mode\nND Filter\nGood Stabilization feature (Standard & Active)\nno fast charging\n\nBest for new YT creator with budget and also for Pro YT for review videos.\nI am happy with the investment... Must have for videos and photos...\nNo phone can match this camera clarity"
            },
            {
                "date": "9 October 2024",
                "title": "Worst camera.",
                "rating": "1.0 out of 5 stars",
                "text": "Its quality is consistently worse than my iPhone 14. It even gets froze sometime."
            },
            {
                "date": "11 January 2021",
                "title": "Tiny power house, good for travel and exciting travel photography",
                "rating": "5.0 out of 5 stars",
                "text": "Ordered cam at the earliest. Tested its functionality, operating excellent. Pleased with the size and power packed in it. Only downside is \"had the lens covered wider\"! Can manage with Ulanzi extended mt 08 tripod stick. Hope to enjoy vlog and travel."
            },
            {
                "date": "26 October 2022",
                "title": "Overall a good camera👍 But...👇",
                "rating": "4.0 out of 5 stars",
                "text": "Q. Is it worth 54k?\nNo, should have been around 40k given that it's from \"2020\" & 2023 is almost here.\n\nQ. Is it easy to use?\nYes, if you're a little experienced & No, if you're a first timer, so make sure you watch those tutorials first.\n\nQ. Is it good for social media & especially YT?\nYes! A 100%.\nUPDATE: The camera is out of the box updated to the latest firmware, so you don't need to update it... Seems a little suspicious.\n\nI liked the camera! Not the price tho!\n🙂👍"
            },
            {
                "date": "2 September 2022",
                "title": "Better only for close up shoots",
                "rating": "5.0 out of 5 stars",
                "text": "No doubt this camera is amazing but it is only for front facing vlogging purpose only. You need to keep your face close to the camera for focus or else it records normal footage. Battery drains within 30 minutes. So I bought two extra batteries for it. As per the price, it's not worth. Someone should go with Sony zv e10 instead."
            }
        ]
    },
    {
        "date": "2025-01-24",
        "time": "02:30",
        "title": "Lenovo ThinkPad E14 Intel Core i3 13th Gen 14\" WUXGA IPS 300 Nits Thin and Light Laptop (8GB RAM/512GB SSD/Windows 11 Home/FPR/Black/1Y Onsite/1.41 kg), 21JKS13L00",
        "price": "₹48,590",
        "discount": "-45%",
        "reviews": [
            {
                "date": "7 November 2024",
                "title": "value for money",
                "rating": "5.0 out of 5 stars",
                "text": "value for money"
            },
            {
                "date": "27 July 2024",
                "title": "Good",
                "rating": "3.0 out of 5 stars",
                "text": "Bit confusing discription for those who uses broad screen like 15 inch width, the actual screen size of this laptop is 16 inch diagonal and 14 inch width. Overall it is working good and fast."
            },
            {
                "date": "21 November 2024",
                "title": "USB and HDMI Port Issue",
                "rating": "1.0 out of 5 stars",
                "text": "HDMI Port Not working after 15 Days. Service center re directing to local service station telling Motherboard need to be replaced, without checking Laptop !"
            },
            {
                "date": "30 January 2023",
                "title": "It's very good Laptop... I am very satisfied in this Device",
                "rating": "5.0 out of 5 stars",
                "text": "I liked the anti glare screen quality of the laptop. Lenovo has a very good laptop 💻👍"
            },
            {
                "date": "6 October 2022",
                "title": "Owesome",
                "rating": "5.0 out of 5 stars",
                "text": "Very good product if it's fits in your budget must go for it"
            },
            {
                "date": "23 October 2024",
                "title": "Great Laptop",
                "rating": "5.0 out of 5 stars",
                "text": "Super laptop, now i understand what the hype around ThinkPad really is.\n\nIt is worth the premium price!!\n\n10/10 recommend"
            },
            {
                "date": "1 January 2023",
                "title": "Performer laptop, value for money",
                "rating": "3.0 out of 5 stars",
                "text": "I am happy with the laptop, since you get what you paid for.\nExpect these in this laptop:\n1. No Kayboard light\n2. Though it says that the display is HD, but the display is not upto the mark. Colour looks different when you change the viewing angle.\n3. Sound quality is quite good\n4. Battery life is moderate. My other i5 thinkpad lasts longer with similar usage. Charges pretty fast with its 65watt charger\n5. It is slightly heavy due to it's metal body"
            },
            {
                "date": "18 October 2024",
                "title": "Amazon se khari nahi kare fraud karta hai sawdhan ho jaye Amazon se",
                "rating": "1.0 out of 5 stars",
                "text": " "
            }
        ]
    },
    {
        "date": "2025-01-24",
        "time": "02:30",
        "title": "Sony PlayStation®5 Console (slim)",
        "price": "₹54,990",
        "discount": "None",
        "reviews": [
            {
                "date": "29 June 2024",
                "title": "Impressive Upgrade to the Gaming Experience 😍😍😍😍",
                "rating": "5.0 out of 5 stars",
                "text": "As an avid gamer, I recently upgraded to the PS5 Slim, and I must say, it has completely transformed my gaming experience. Here’s why I think the PS5 Slim is a fantastic choice:\n\n**Performance:** The PS5 Slim delivers breathtaking performance with its lightning-fast load times and seamless gameplay. Whether I'm exploring vast open worlds or engaging in intense multiplayer battles, the console handles everything effortlessly.\n\n**Graphics:** The visuals are simply stunning. The 4K resolution and HDR capabilities bring games to life with vibrant colors and incredible detail. Every frame feels like a work of art, enhancing immersion and making every gaming session unforgettable.\n\n**Controller:** The DualSense controller is a game-changer. The adaptive triggers and haptic feedback add a new layer of realism to games, allowing me to feel every action and movement in a way that was never possible before. It truly enhances the gameplay experience.\n\n**Design:** The PS5 Slim’s sleek and compact design fits perfectly into my gaming setup. It’s not only aesthetically pleasing but also practical, with improved cooling systems that ensure the console stays quiet and cool even during extended gaming sessions.\n\n**Game Library:** With a vast library of exclusive titles and backward compatibility with PS4 games, there's no shortage of games to play on the PS5 Slim. From blockbuster AAA titles to indie gems, there’s something for every type of gamer.\n\n**User Interface:** Navigating the user interface is smooth and intuitive, allowing me to switch between games, apps, and media seamlessly. The interface is designed to prioritize the gaming experience, making it easy to find what I want quickly.\n\n**Overall Experience:** In conclusion, the PS5 Slim has exceeded my expectations in every way. It’s not just a gaming console; it’s a gateway to new adventures and unforgettable experiences. Whether you’re a casual gamer or a hardcore enthusiast, the PS5 Slim is definitely worth every penny. Highly recommended!"
            },
            {
                "date": "5 December 2024",
                "title": "100% Original Product!",
                "rating": "5.0 out of 5 stars",
                "text": "It's a genuine Sony product of Indian variety. The seller is reliable in the sense that I have recieved a genuine Sony PS5 Slim console (disc edition) in perfect condition that opens up new vistas in the world of gaming. This console is a must-have asset for pro and normal gamers. But, one thing to note, please don't expect any after-sales-support from the seller, as I have experienced in my case, when I observed that the yellow warranty card, meant for India, was missing in the console's package, and contacted the seller for support, and unfortunately received no response! Then, I contacted Sony India customer care both over the phone and email, sent the copy of the invoice as generated by the seller, a snapshot of the serial number on the bottom side of the company box, as well as the serial number on the bottom side of the console itself. Next, within a few days, the warranty card was sent by Sony through courier to my residence. Kudos for Sony for this wonderful service! Wish the seller had been equally responsible and prompt in handling customers' issues. However, at the end I hope everything will go well and extend my heartfelt thanks to the seller and Sony for their respective services."
            },
            {
                "date": "29 December 2024",
                "title": "Delivery on-time",
                "rating": "5.0 out of 5 stars",
                "text": "It was delivered on-time. Product is new and in good quality. Seller:e2zStore."
            },
            {
                "date": "28 November 2024",
                "title": "The manufacturing date is 1 year old. I.e Nov’24",
                "rating": "1.0 out of 5 stars",
                "text": "I ordered the slim version on 24th Nov’24 and got delivery on 26th. If the slim version is launched in India in Apr’24, how come I got a slim version manufactured in Nov’23? One year old product.\nCan anyone help? Should I return the product\nPlz"
            },
            {
                "date": "2 January 2025",
                "title": "Best console ever . Worth the Money",
                "rating": "5.0 out of 5 stars",
                "text": "The packaging was perfectly intact. The ps5’s box was shipped in a very spacious cardboard box.Unboxing was very satisfying.Functionalities:\n1 Very powerful. It can handle NFS Unbound smoothly at 4K 60fps with HDR\n2 The dual sense controller can also be used as a normal controller for any BT compatible device\n3 even though it does not have a Bluetooth module, an external adapter can be used to connect BT devices with the BT option in settings\nWould recommend buying"
            },
            {
                "date": "21 November 2024",
                "title": "PS5 slim is lit",
                "rating": "5.0 out of 5 stars",
                "text": "Best gaming console"
            },
            {
                "date": "20 January 2025",
                "title": "Seal was not broken. Little bit damaged",
                "rating": "4.0 out of 5 stars",
                "text": "Console is brand new. Was just afraid to order since it had bad reviews. But at 45.25k it is a steal deal. Fortunately i got a good piece too"
            },
            {
                "date": "15 December 2024",
                "title": "Good product Considering ps4 console is still expensive!",
                "rating": "5.0 out of 5 stars",
                "text": "Steal deal Considering that ps4 console is just a few thousand rupees cheaper.\nGames are expensive but that's ok.\nHeat is managed well."
            }
        ]
    },
    {
        "date": "2025-01-24",
        "time": "02:30",
        "title": "Whirlpool 7 Kg 5 Star Royal Fully-Automatic Top Loading Washing Machine (WHITEMAGIC ROYAL 7.0 GENX, Grey, Hard Water Wash, ZPF Technology)",
        "price": "₹14,990",
        "discount": "-6%",
        "reviews": [
            {
                "date": "11 January 2025",
                "title": "Nice product",
                "rating": "5.0 out of 5 stars",
                "text": "Good Product worth money and nice service / installation."
            },
            {
                "date": "18 December 2024",
                "title": "Good But without accessories",
                "rating": "4.0 out of 5 stars",
                "text": "Hi All,\n\nIf you are going to use hard water dont buy this. because it is having hard water wash not water smoothing technology.\nInstallation person will suggest one softner worth 2000 from whrilpool.\nagain they will explain all the accessories in such a way that you will be forced to bye everything like I did. Because no body wantes there product to last less.\nso apart from 15k I spent 5k more for accessories.\n\nstand - they recommend 4 wheel lock iron stand otherwise your drum will vibrate more and may damage soon. = 1525/-\n\nwater softner for better wash and protecting the machine and save you from hard water damages = 2000/-\n\nTheir own Drum cleaner for 9 months and you have to clean once in 45 days = 1400\n\nDetergent which can do the work of vanish, comfort and washing : 350 for 1 ltr (I have taken this just try how it is working)\n\nTotal around 5 k extra.\n\nalthough the machine is good and looks like feature loaded but not recommended to use in Hard water areas like metro cities and all."
            },
            {
                "date": "16 January 2025",
                "title": "Very good products",
                "rating": "5.0 out of 5 stars",
                "text": "Performance very nice...value for money 👌👌👌👌"
            },
            {
                "date": "11 January 2025",
                "title": "Pathetic machine , disgusting product",
                "rating": "1.0 out of 5 stars",
                "text": "I have buyer this product on 22 dec which was delivered to me broken , Amazon’s delivery staff is hurry to get that delivered & leave without completely opened , I call to customer service they suggest me to put this on replacement , which is taken all 19 day to get my replacement machine back , which was delivered 11 jan it was delivered again , now the internal machine system is not working , now Amazon’s team is not provide any solution & asking to return the product again , once again it will take 2 week to get my refund back , wasted of trust , time & money , no solution provided except return"
            },
            {
                "date": "14 January 2025",
                "title": "Value for money product",
                "rating": "5.0 out of 5 stars",
                "text": "Ergonomic design. Good product\n."
            },
            {
                "date": "13 January 2025",
                "title": "Good very much, thank you for",
                "rating": "5.0 out of 5 stars",
                "text": "Hi sir washing machine very good will help you using thank you all"
            },
            {
                "date": "18 January 2025",
                "title": "Good product",
                "rating": "4.0 out of 5 stars",
                "text": "Couldn't download invoice, please address the issue"
            },
            {
                "date": "28 June 2024",
                "title": "Good for the price",
                "rating": "3.0 out of 5 stars",
                "text": "Good things are mention in the product description am listing only Cons compared to samsung 7kg top load bubble wash as I am also using Samsung for 1.5 years\n\nMetal body can catchup corrosion or paint loss over the time and even the small collision creates a dent on the metal body so fiber body would be better option\n\nNo DD (direct drive system) in the Q&A Page it is mentioned that it is direct drive but I got to know that it is not fully direct drive main drive is direct and drum drive is belt so it makes more noise and vibration compared to samsung\n\n5% more vibration and 10% more noise than samsung, anything you do but don't keep the machine on any type of stand or base support stand it will vibrate even more plat surface is better option\n\nHard water wash requires magnetic filter which costs 2000rs extra otherwise hard water wash does not function but in samsung they have built in magnetic filter no need to worry about magnetic filter in samsung\n\nIn any wash mode you select this machine requires more time than samsung\n\nIf you are looking for this product with magnetic filter 2k extra then it is good to go for samsung in the same price range.\n\nDelivery was bit complicated Delivery guy was bit worried to deliver to 1st Floor as my address did not mention the floor number so I had to tip him which is my decision\n\nInstallation experience was wonderful for duct came with no damage and all the functions were working as it should be."
            }
        ]
    },
    {
        "date": "2025-01-24",
        "time": "02:30",
        "title": "Samsung Galaxy S23 Ultra 5G AI Smartphone (Phantom Black, 12GB, 256GB Storage)",
        "price": "₹71,999",
        "discount": "-52%",
        "reviews": [
            {
                "date": "14 October 2024",
                "title": "my experience of using the S23 ultra for 1 onth",
                "rating": "5.0 out of 5 stars",
                "text": "I had switched to the S23 Ultra from the iPhone 13. For me, the S23 Ultra is in a different league compared to the iPhone 13. The cameras are so much better and the telephoto lens of the phone also adds an interesting and useful component to the phone. even when gaming, it gives me 120 fps in most of the games. the display is fantastic and even the charging is adequately fast and reliable. (you need to buy the 45w charger separately.) apart from that, the speakers are fantastic and the haptic feedback is great too. The only major downside I found is that it heats a little bit while you play heavy games and the phone charges slowly while being used. overall, if you can get this phone below 85k now, definitely go for it as it almost has no difference compared to the S24 ultra. The battery backup is also great and 1.5 charging cycles lasts me the entire day. (my average SOT is 10-14 hours). The S pen is also quite handy and is useful occasionally. I would say this is the best all-rounder Android phone you can get if you're looking for a phone below the 100k barrier. Also, the phone will get updates till Android 17 so there is no worry of the OS falling back in time and will run you a good 3 years even if you buy the phone now. Remember that the phone is huge and only buy it if you're comfortable with this form factor or this phone may render as useless to you. go for the regular s23 models if you're not a hardcore user but if you have the budget and requiremnts of the features in this phone i would 100% recommend this phone to you."
            },
            {
                "date": "15 January 2025",
                "title": "Awesome Phone",
                "rating": "5.0 out of 5 stars",
                "text": "Samsung Galaxy S23 Ultra: A Powerhouse of Performance\nThe Samsung Galaxy S23 Ultra is a top-tier smartphone that excels in almost every category. Its standout features include:\n* Incredible Camera: The 200MP main sensor captures stunning photos with incredible detail and dynamic range.\n* Powerful Performance: The Snapdragon 8 Gen 2 processor delivers blazing-fast speeds and smooth multitasking.\n* Vibrant Display: The dynamic AMOLED 2X display boasts incredible brightness, sharp visuals, and smooth scrolling.\n* Long-lasting Battery: The large battery provides all-day endurance, even with heavy usage.\nHowever:\n* Expensive: The S23 Ultra comes with a premium price tag.\n* S Pen can be finicky: Some users find the S Pen integration to be less seamless than advertised.\nOverall:\nThe Samsung Galaxy S23 Ultra is an exceptional smartphone for demanding users. If you're looking for the best of the best and are willing to pay the price, it's a fantastic choice.\nDisclaimer: This is a brief overview. For a more in-depth analysis, please refer to full reviews from reputable tech publications.\nI hope this helps!"
            },
            {
                "date": "31 December 2024",
                "title": "Mobile of the year 2023 and 2024",
                "rating": "5.0 out of 5 stars",
                "text": "Awesome phone just loving it though indont use for gaming etc mainy social media and multiple taskings only and camera and all these area its good..initially i was worried when i got to know that there is no app lock but later after getting used to secure folder secured by knox i am happy with it, display is good is sound is also good connecitvity is alao good and works well with samsung eco system\nWhen i purchased there were very few pieces in the market and i i had to sold old phone and get new one so i got one with a bit higher price...buts a value for money.."
            },
            {
                "date": "19 January 2025",
                "title": "Good but battery issue",
                "rating": "4.0 out of 5 stars",
                "text": "Phone look wise amazing\nGreat camera quality both front and rear value for money\nGreat Touch quality and smoothness\nAI feature is functionality fantastic\n\nBut as far as battery life is concerned draining very fast .....needs to charge twice or thrice a day without any heavy usage of phone\n\nApart from this phn is gud so far"
            },
            {
                "date": "13 September 2024",
                "title": "Go for it",
                "rating": "5.0 out of 5 stars",
                "text": "Samsung S23 Ultra Review\n\nS23 Ultra is a true powerhouse and an impressive flagship device. Here’s a breakdown of the key features and performance:\n\nDesign & Build: The design is sleek and premium with a polished metal frame and glass back. It feels solid in hand, though it’s slightly heavier due to its large size. The curved edges and near-bezel-less display give it a modern, elegant look.\n\nDisplay: The 6.8-inch Dynamic AMOLED 2X display is stunning. Colors are vibrant, blacks are deep, and it offers fantastic brightness even in direct sunlight. The 120Hz refresh rate makes scrolling smooth and the overall experience buttery.\n\nPerformance: Powered by the Snapdragon 8 Gen 2 chipset (or Exynos, depending on the region), this phone can handle anything you throw at it. Whether gaming, multitasking, or using heavy apps, the performance remains snappy without any lags.\n\nCamera: The highlight of the S23 Ultra is its camera setup. The 200MP main sensor captures incredible detail, and the photos in good lighting are rich and sharp. Low-light performance is also top-notch. The 10x optical zoom is another standout feature, allowing for clear shots from afar. It’s ideal for photography enthusiasts.\n\nBattery Life: With a 5000mAh battery, the S23 Ultra comfortably lasts a full day on moderate use. Even with heavy use, you can get through the day without needing a recharge. Fast charging and wireless charging are both supported, though it lacks the ultra-fast charging speeds seen in some competitors.\n\nSoftware: Running on Android 13 with Samsung’s One UI, the experience is smooth and highly customizable. Samsung has also committed to providing long-term software updates, which is a big plus for future-proofing the device.\n\nVerdict: The Samsung S23 Ultra is a premium device with a price tag to match, but it justifies the cost with its exceptional display, powerful performance, and top-tier camera capabilities. If you're looking for a flagship Android phone that excels in nearly every aspect, the S23 Ultra is a strong contender.\n\nPros:\n\nStunning AMOLED display\n\nExceptional camera performance\n\nStrong performance for gaming and multitasking\n\nSolid battery life\n\nCons:\n\nQuite bulky and heavy\n\nExpensive"
            }
        ]
    }
]